{"papers":[{"url":"https://www.semanticscholar.org/paper/You-Are-What-You-Tweet:-Analyzing-Twitter-for-Paul-Dredze/e4e3d5552a0071f4f677d06c672c31b402b1266c?utm_campaign=DBLP+Prototype&utm_source=DBLP&utm_medium=Partner+API","title":"You Are What You Tweet: Analyzing Twitter for Public Health","authors":[{"name":"Michael J. Paul","url":"https://www.semanticscholar.org/author/Michael-J.-Paul/143946641"},{"name":"Mark Dredze","url":"https://www.semanticscholar.org/author/Mark-Dredze/1782853"}],"venue":"ICWSM","year":2011,"stats":{"influentialCitations":44,"estimatedTotalCitations":615.48883298243,"velocity":81.66666666666667,"acceleration":-0.15584415584415584},"paperAbstract":"Analyzing user messages in social media can measure different population characteristics, including public health measures. For example, recent work has correlated Twitter messages with influenza rates in the United States; but this has largely been the extent of mining Twitter for public health. In this work, we consider a broader range of public health applications for Twitter. We apply the recently introduced Ailment Topic Aspect Model to over one and a half million health related tweets and discover mentions of over a dozen ailments, including allergies, obesity and insomnia. We introduce extensions to incorporate prior knowledge into this model and apply it to several tasks: tracking illnesses over times (syndromic surveillance), measuring behavioral risk factors, localizing illnesses by geographic region, and analyzing symptoms and medication usage. We show quantitative correlations with public health data and qualitative evaluations of model output. Our results suggest that Twitter has broad applicability for public health research.","sourceIds":["conf/icwsm/PaulD11"]},{"url":"https://www.semanticscholar.org/paper/Short-text-classification-in-twitter-to-improve-Sriram-Fuhry/e23ac4b63031d9f445ec7c297a237b514082347c?utm_campaign=DBLP+Prototype&utm_source=DBLP&utm_medium=Partner+API","title":"Short text classification in twitter to improve information filtering","authors":[{"name":"Bharath Sriram","url":"https://www.semanticscholar.org/author/Bharath-Sriram/32620095"},{"name":"Dave Fuhry","url":"https://www.semanticscholar.org/author/Dave-Fuhry/1396735724"},{"name":"Engin Demir","url":"https://www.semanticscholar.org/author/Engin-Demir/115408207"},{"name":"Hakan Ferhatosmanoglu","url":"https://www.semanticscholar.org/author/Hakan-Ferhatosmanoglu/1787789"},{"name":"Murat Demirbas","url":"https://www.semanticscholar.org/author/Murat-Demirbas/1398534303"}],"venue":"SIGIR '10","year":2010,"stats":{"influentialCitations":36,"estimatedTotalCitations":436.3890411475985,"velocity":64.66666666666667,"acceleration":-0.37681159420289856},"journal":{"pages":"841-842"},"paperAbstract":"In microblogging services such as Twitter, the users may become overwhelmed by the raw data. One solution to this problem is the classification of short text messages. As short texts do not provide sufficient word occurrences, traditional classification methods such as \"Bag-Of-Words\" have limitations. To address this problem, we propose to use a small set of domain-specific features extracted from the author's profile and text. The proposed approach effectively classifies the text to a predefined set of generic classes such as News, Events, Opinions, Deals, and Private Messages.","sourceIds":["conf/sigir/SriramFDFD10"]},{"url":"https://www.semanticscholar.org/paper/Event-Detection-in-Twitter-Weng-Lee/d0b99e208dfa48b06ae1c54e0fc1e1dacb34f617?utm_campaign=DBLP+Prototype&utm_source=DBLP&utm_medium=Partner+API","title":"Event Detection in Twitter","authors":[{"name":"Jianshu Weng","url":"https://www.semanticscholar.org/author/Jianshu-Weng/1974162"},{"name":"Bu-Sung Lee","url":"https://www.semanticscholar.org/author/Bu-Sung-Lee/1717989"}],"venue":"ICWSM","year":2011,"stats":{"influentialCitations":69,"estimatedTotalCitations":467.7357663649296,"velocity":58.666666666666664,"acceleration":-0.42424242424242425},"paperAbstract":"Twitter, as a form of social media, is fast emerging in recent years. Users are using Twitter to report real-life events. This paper focuses on  detecting those events by analyzing the text stream in Twitter. Although event detection has long been a research topic, the characteristics of Twitter make it a non-trivial task. Tweets reporting such events are usually overwhelmed by high flood of meaningless “babbles”. Moreover, event detection algorithm needs to be scalable given the sheer amount of tweets. This paper attempts to tackle these challenges with EDCoW (Event Detection with Clustering of Wavelet-based Signals). EDCoW builds signals for individual words by applying wavelet analysis on the frequencybased raw signals of the words. It then filters away the trivial words by looking at their corresponding signal autocorrelations. The remaining words are then clustered to form events with a modularity-based graph partitioning technique. Experimental results show promising result of EDCoW.","sourceIds":["conf/icwsm/WengL11"]},{"url":"https://www.semanticscholar.org/paper/Information-credibility-on-twitter-Castillo-Mendoza/53295bc919e02289b78918b07d1252b3e4c5e3ca?utm_campaign=DBLP+Prototype&utm_source=DBLP&utm_medium=Partner+API","title":"Information credibility on twitter","authors":[{"name":"Carlos Castillo","url":"https://www.semanticscholar.org/author/Carlos-Castillo/145668771"},{"name":"Marcelo Mendoza","url":"https://www.semanticscholar.org/author/Marcelo-Mendoza/145893609"},{"name":"Barbara Poblete","url":"https://www.semanticscholar.org/author/Barbara-Poblete/2272762"}],"venue":"WWW","year":2011,"stats":{"influentialCitations":153,"estimatedTotalCitations":783.136884741358,"velocity":144.66666666666666,"acceleration":0.23880597014925373},"journal":{"pages":"675-684"},"paperAbstract":"We analyze the information credibility of news propagated through Twitter, a popular microblogging service. Previous research has shown that most of the messages posted on Twitter are truthful, but the service is also used to spread misinformation and false rumors, often unintentionally.\n On this paper we focus on automatic methods for assessing the credibility of a given set of tweets. Specifically, we analyze microblog postings related to \"trending\" topics, and classify them as credible or not credible, based on features extracted from them. We use features from users' posting and re-posting (\"re-tweeting\") behavior, from the text of the posts, and from citations to external sources.\n We evaluate our methods using a significant number of human assessments about the credibility of items on a recent sample of Twitter postings. Our results shows that there are measurable differences in the way messages propagate, that can be used to classify them automatically as credible or not credible, with precision and recall in the range of 70% to 80%.","sourceIds":["conf/www/CastilloMP11"]},{"url":"https://www.semanticscholar.org/paper/Target-dependent-Twitter-Sentiment-Classification-Jiang-Yu/7ba9dcbd2e9163f2684b098786bbc3abb4784905?utm_campaign=DBLP+Prototype&utm_source=DBLP&utm_medium=Partner+API","title":"Target-dependent Twitter Sentiment Classification","authors":[{"name":"Long Jiang","url":"https://www.semanticscholar.org/author/Long-Jiang/47420741"},{"name":"Mo Yu","url":"https://www.semanticscholar.org/author/Mo-Yu/2482533"},{"name":"Ming Zhou","url":"https://www.semanticscholar.org/author/Ming-Zhou/143849609"},{"name":"Xiaohua Liu","url":"https://www.semanticscholar.org/author/Xiaohua-Liu/1900811"},{"name":"Tiejun Zhao","url":"https://www.semanticscholar.org/author/Tiejun-Zhao/145382463"}],"venue":"ACL","year":2011,"stats":{"influentialCitations":42,"estimatedTotalCitations":491.8978096415526,"velocity":66.33333333333333,"acceleration":0.22033898305084745},"journal":{"pages":"151-160"},"paperAbstract":"Sentiment analysis on Twitter data has attracted much attention recently. In this paper, we focus on target-dependent Twitter sentiment classification; namely, given a query, we classify the sentiments of the tweets as positive, negative or neutral according to whether they contain positive, negative or neutral sentiments about that query. Here the query serves as the target of the sentiments. The state-of-the-art approaches for solving this problem always adopt the target-independent strategy, which may assign irrelevant sentiments to the given target. Moreover, the state-of-the-art approaches only take the tweet to be classified into consideration when classifying the sentiment; they ignore its context (i.e., related tweets). However, because tweets are usually short and more ambiguous, sometimes it is not enough to consider only the current tweet for sentiment classification. In this paper, we propose to improve target-dependent Twitter sentiment classification by 1) incorporating target-dependent features; and 2) taking related tweets into consideration. According to the experimental results, our approach greatly improves the performance of target-dependent sentiment classification.","sourceIds":["conf/acl/JiangYZLZ11"]},{"url":"https://www.semanticscholar.org/paper/A-few-chirps-about-twitter-Krishnamurthy-Gill/8a583c4e638560fa5963bdb4a79db93575d45762?utm_campaign=DBLP+Prototype&utm_source=DBLP&utm_medium=Partner+API","title":"A few chirps about twitter","authors":[{"name":"Balachander Krishnamurthy","url":"https://www.semanticscholar.org/author/Balachander-Krishnamurthy/145846952"},{"name":"Phillipa Gill","url":"https://www.semanticscholar.org/author/Phillipa-Gill/36757962"},{"name":"Martin F. Arlitt","url":"https://www.semanticscholar.org/author/Martin-F.-Arlitt/2185810"}],"venue":"WOSN '08","year":2008,"stats":{"influentialCitations":44,"estimatedTotalCitations":450.9475501473852,"velocity":21.0,"acceleration":-0.5833333333333334},"journal":{"pages":"19-24"},"paperAbstract":"Web 2.0 has brought about several new applications that have enabled arbitrary subsets of users to communicate with each other on a social basis. Such communication increasingly happens not just on Facebook and MySpace but on several smaller network applications such as Twitter and Dodgeball. We present a detailed characterization of Twitter, an application that allows users to send short messages. We gathered three datasets (covering nearly 100,000 users) including constrained crawls of the Twitter network using two different methodologies, and a sampled collection from the publicly available timeline. We identify distinct classes of Twitter users and their behaviors, geographic growth patterns and current size of the network, and compare crawl results obtained under rate limiting constraints.","sourceIds":["conf/wosn/KrishnamurthyGA08"]},{"url":"https://www.semanticscholar.org/paper/TwitterMonitor:-trend-detection-over-the-twitter-Mathioudakis-Koudas/0c7247c74f946590eca6221d5b9d906d0f4d22c3?utm_campaign=DBLP+Prototype&utm_source=DBLP&utm_medium=Partner+API","title":"TwitterMonitor: trend detection over the twitter stream","authors":[{"name":"Michael Mathioudakis","url":"https://www.semanticscholar.org/author/Michael-Mathioudakis/49105984"},{"name":"Nick Koudas","url":"https://www.semanticscholar.org/author/Nick-Koudas/1721062"}],"venue":"SIGMOD Conference","year":2010,"stats":{"influentialCitations":62,"estimatedTotalCitations":590.6630143957766,"velocity":59.0,"acceleration":-0.32142857142857145},"journal":{"pages":"1155-1158"},"paperAbstract":"We present TwitterMonitor, a system that performs trend detection over the Twitter stream. The system identifies emerging topics (i.e. 'trends') on Twitter in real time and provides meaningful analytics that synthesize an accurate description of each topic. Users interact with the system by ordering the identified trends using different criteria and submitting their own description for each trend.\n We discuss the motivation for trend detection over social media streams and the challenges that lie therein. We then describe our approach to trend detection, as well as the architecture of TwitterMonitor. Finally, we lay out our demonstration scenario.","sourceIds":["conf/sigmod/MathioudakisK10"]},{"url":"https://www.semanticscholar.org/paper/Empirical-study-of-topic-modeling-in-Twitter-Hong-Davison/9bff6829d854d6fe38c5e8f4221aea6fc6ea1e18?utm_campaign=DBLP+Prototype&utm_source=DBLP&utm_medium=Partner+API","title":"Empirical study of topic modeling in Twitter","authors":[{"name":"Liangjie Hong","url":"https://www.semanticscholar.org/author/Liangjie-Hong/33888728"},{"name":"Brian D. Davison","url":"https://www.semanticscholar.org/author/Brian-D.-Davison/1800527"}],"venue":"SOMA '10","year":2010,"stats":{"influentialCitations":60,"estimatedTotalCitations":538.5182964296962,"velocity":80.33333333333333,"acceleration":-0.189873417721519},"journal":{"pages":"80-88"},"paperAbstract":"Social networks such as Facebook, LinkedIn, and Twitter have been a crucial source of information for a wide spectrum of users. In Twitter, popular information that is deemed important by the community propagates through the network. Studying the characteristics of content in the messages becomes important for a number of tasks, such as breaking news detection, personalized message recommendation, friends recommendation, sentiment analysis and others. While many researchers wish to use standard text mining tools to understand messages on Twitter, the restricted length of those messages prevents them from being employed to their full potential.\n We address the problem of using standard topic models in micro-blogging environments by studying how the models can be trained on the dataset. We propose several schemes to train a standard topic model and compare their quality and effectiveness through a set of carefully designed experiments from both qualitative and quantitative perspectives. We show that by training a topic model on aggregated messages we can obtain a higher quality of learned model which results in significantly better performance in two real-world classification problems. We also discuss how the state-of-the-art Author-Topic model fails to model hierarchical relationships between entities in Social Media.","sourceIds":["conf/kdd/Hong010"]},{"url":"https://www.semanticscholar.org/paper/Twitter-mood-predicts-the-stock-market-Bollen-Mao/e498784edf2c02fe0b228479f88120f08b381cb6?utm_campaign=DBLP+Prototype&utm_source=DBLP&utm_medium=Partner+API","title":"Twitter mood predicts the stock market","authors":[{"name":"Johan Bollen","url":"https://www.semanticscholar.org/author/Johan-Bollen/1756468"},{"name":"Huina Mao","url":"https://www.semanticscholar.org/author/Huina-Mao/12145107"},{"name":"Xiao-Jun Zeng","url":"https://www.semanticscholar.org/author/Xiao-Jun-Zeng/145681778"}],"venue":"J. Comput. Sci.","year":2011,"stats":{"influentialCitations":226,"estimatedTotalCitations":1624.650911760977,"velocity":282.6666666666667,"acceleration":-0.1903114186851211},"journal":{"name":"J. Comput. Sci.","volume":"2","pages":"1-8"},"paperAbstract":"Behavioral economics tells us that emotions can profoundly affect individual behavior and decision-making. Does this also apply to societies at large, i.e. can societies experience mood states that affect their collective decision making? By extension is the public mood correlated or even predictive of economic indicators? Here we investigate whether measurements of collective mood states derived from large-scale Twitter feeds are correlated to the value of the Dow Jones Industrial Average (DJIA) over time. We analyze the text content of daily Twitter feeds by two mood tracking tools, namely OpinionFinder that measures positive vs. negative mood and Google-Profile of Mood States (GPOMS) that measures mood in terms of 6 dimensions (Calm, Alert, Sure, Vital, Kind, and Happy). We cross-validate the resulting mood time series by comparing their ability to detect the public's response to the presidential election and Thanksgiving day in 2008. A Granger causality analysis and a Self-Organizing Fuzzy Neural Network are then used to investigate the hypothesis that public mood states, as measured by the OpinionFinder and GPOMS mood time series, are predictive of changes in DJIA closing values. Our results indicate that the accuracy of DJIA predictions can be significantly improved by the inclusion of specific public mood dimensions but not others. We find an accuracy of 87.6% in predicting the daily up and down changes in the closing values of the DJIA and a reduction of the Mean Average Percentage Error by more than 6%. Index Terms—stock market prediction — twitter — mood analysis.","sourceIds":["journals/jocs/BollenMZ11","journals/corr/abs-1010-3003"]},{"url":"https://www.semanticscholar.org/paper/Political-Polarization-on-Twitter-Conover-Ratkiewicz/9a7ae269358c6366cc46dc924d63b47ba405d082?utm_campaign=DBLP+Prototype&utm_source=DBLP&utm_medium=Partner+API","title":"Political Polarization on Twitter","authors":[{"name":"Michael D. Conover","url":"https://www.semanticscholar.org/author/Michael-D.-Conover/49479696"},{"name":"Jacob Ratkiewicz","url":"https://www.semanticscholar.org/author/Jacob-Ratkiewicz/2951268"},{"name":"Matthew R. Francisco","url":"https://www.semanticscholar.org/author/Matthew-R.-Francisco/3340774"},{"name":"Bruno Gonçalves","url":"https://www.semanticscholar.org/author/Bruno-Gonçalves/145621244"},{"name":"Filippo Menczer","url":"https://www.semanticscholar.org/author/Filippo-Menczer/143653472"},{"name":"Alessandro Flammini","url":"https://www.semanticscholar.org/author/Alessandro-Flammini/1769960"}],"venue":"ICWSM","year":2011,"stats":{"influentialCitations":60,"estimatedTotalCitations":481.3054650782967,"velocity":84.0,"acceleration":0.2236842105263158},"paperAbstract":"In this study we investigate how social media shape the networked public sphere and facilitate communication between communities with different political orientations. We examine two networks of political communication on Twitter, comprised of more than 250,000 tweets from the six weeks leading up to the 2010 U.S. congressional midterm elections. Using a combination of network clustering algorithms and manually-annotated data we demonstrate that the network of political retweets exhibits a highly segregated partisan structure, with extremely limited connectivity between left- and right-leaning users. Surprisingly this is not the case for the user-to-user mention network, which is dominated by a single politically heterogeneous cluster of users in which ideologically-opposed individuals interact at a much higher rate compared to the network of retweets. To explain the distinct topologies of the retweet and mention networks we conjecture that politically motivated individuals provoke interaction by injecting partisan content into information streams whose primary audience consists of ideologically-opposed users. We conclude with statistical evidence in support of this hypothesis.","sourceIds":["conf/icwsm/ConoverRFGMF11"]},{"url":"https://www.semanticscholar.org/paper/Twitter-Sentiment-Analysis:-The-Good-the-Bad-and-Kouloumpis-Wilson/2139a684ba686ec6f7386ff4a0d6113e4e0b780b?utm_campaign=DBLP+Prototype&utm_source=DBLP&utm_medium=Partner+API","title":"Twitter Sentiment Analysis: The Good the Bad and the OMG!","authors":[{"name":"Efthymios Kouloumpis","url":"https://www.semanticscholar.org/author/Efthymios-Kouloumpis/2821360"},{"name":"Theresa Wilson","url":"https://www.semanticscholar.org/author/Theresa-Wilson/47481818"},{"name":"Johanna D. Moore","url":"https://www.semanticscholar.org/author/Johanna-D.-Moore/2050835"}],"venue":"ICWSM","year":2011,"stats":{"influentialCitations":46,"estimatedTotalCitations":651.2360813529637,"velocity":113.66666666666667,"acceleration":-0.2605042016806723},"paperAbstract":"In this paper, we investigate the utility of linguistic features for detecting the sentiment of Twitter messages. We evaluate the usefulness of existing lexical resources as well as features that capture information about the informal and creative language used in microblogging. We take a supervied approach to the problem, but leverage existing hashtags in the Twitter data for building training data.","sourceIds":["conf/icwsm/KouloumpisWM11"]},{"url":"https://www.semanticscholar.org/paper/Everyone's-an-influencer:-quantifying-influence-on-Bakshy-Hofman/9d183e21728d612da8d933f99be72890b2db0351?utm_campaign=DBLP+Prototype&utm_source=DBLP&utm_medium=Partner+API","title":"Everyone's an influencer: quantifying influence on twitter","authors":[{"name":"Eytan Bakshy","url":"https://www.semanticscholar.org/author/Eytan-Bakshy/3071703"},{"name":"Jake M. Hofman","url":"https://www.semanticscholar.org/author/Jake-M.-Hofman/40368603"},{"name":"Winter A. Mason","url":"https://www.semanticscholar.org/author/Winter-A.-Mason/47787843"},{"name":"Duncan J. Watts","url":"https://www.semanticscholar.org/author/Duncan-J.-Watts/1783914"}],"venue":"WSDM '11","year":2011,"stats":{"influentialCitations":104,"estimatedTotalCitations":890.0207762220588,"velocity":111.0,"acceleration":-0.21311475409836064},"journal":{"pages":"65-74"},"paperAbstract":"In this paper we investigate the attributes and relative influence of 1.6M Twitter users by tracking 74 million diffusion events that took place on the Twitter follower graph over a two month interval in 2009. Unsurprisingly, we find that the largest cascades tend to be generated by users who have been influential in the past and who have a large number of followers. We also find that URLs that were rated more interesting and/or elicited more positive feelings by workers on Mechanical Turk were more likely to spread. In spite of these intuitive results, however, we find that predictions of which particular user or URL will generate large cascades are relatively unreliable. We conclude, therefore, that word-of-mouth diffusion can only be harnessed reliably by targeting large numbers of potential influencers, thereby capturing average effects. Finally, we consider a family of hypothetical marketing strategies, defined by the relative cost of identifying versus compensating potential \"influencers.\" We find that although under some circumstances, the most influential users are also the most cost-effective, under a wide range of plausible assumptions the most cost-effective performance can be realized using \"ordinary influencers\"---individuals who exert average or even less-than-average influence.","sourceIds":["conf/wsdm/BakshyHMW11"]},{"url":"https://www.semanticscholar.org/paper/Beyond-Trending-Topics:-Real-World-Event-on-Twitter-Becker-Naaman/bb7965a9dbeab34cec56e19aae949690f2463f20?utm_campaign=DBLP+Prototype&utm_source=DBLP&utm_medium=Partner+API","title":"Beyond Trending Topics: Real-World Event Identification on Twitter","authors":[{"name":"Hila Becker","url":"https://www.semanticscholar.org/author/Hila-Becker/47503402"},{"name":"Mor Naaman","url":"https://www.semanticscholar.org/author/Mor-Naaman/1687465"},{"name":"Luis Gravano","url":"https://www.semanticscholar.org/author/Luis-Gravano/1684012"}],"venue":"ICWSM","year":2011,"stats":{"influentialCitations":45,"estimatedTotalCitations":465.30628765662954,"velocity":64.0,"acceleration":-0.2962962962962963},"paperAbstract":"User-contributed messages on social media sites such as Twitter have emerged aspowerful, real-time means of information sharing on the Web. These short messages tend to reflect a variety of events in real time, making Twitter particularly well suited as a source of real-time event content. In this paper, we explore approaches for analyzing the stream of Twitter messages to distinguish between messages about real-world events andnon-event messages. Our approach relies on a rich family of aggregatestatistics of topically similar message clusters. Large-scale experiments over millions of Twitter messages show the effectiveness of our approach for surfacing real-world event content on Twitter.","sourceIds":["conf/icwsm/BeckerNG11"]},{"url":"https://www.semanticscholar.org/paper/Comparing-Twitter-and-Traditional-Media-Using-Topic-Zhao-Jiang/49ae87c25dbad1ed88256b175459ce1c81f445ac?utm_campaign=DBLP+Prototype&utm_source=DBLP&utm_medium=Partner+API","title":"Comparing Twitter and Traditional Media Using Topic Models","authors":[{"name":"Wayne Xin Zhao","url":"https://www.semanticscholar.org/author/Wayne-Xin-Zhao/2542603"},{"name":"Jing Jiang","url":"https://www.semanticscholar.org/author/Jing-Jiang/144924150"},{"name":"Jianshu Weng","url":"https://www.semanticscholar.org/author/Jianshu-Weng/1974162"},{"name":"Jing He","url":"https://www.semanticscholar.org/author/Jing-He/143852605"},{"name":"Ee-Peng Lim","url":"https://www.semanticscholar.org/author/Ee-Peng-Lim/1709901"},{"name":"Hongfei Yan","url":"https://www.semanticscholar.org/author/Hongfei-Yan/2153973"},{"name":"Xiaoming Li","url":"https://www.semanticscholar.org/author/Xiaoming-Li/21515518"}],"venue":"ECIR","year":2011,"stats":{"influentialCitations":99,"estimatedTotalCitations":594.2562061239122,"velocity":94.0,"acceleration":-0.2524271844660194},"journal":{"pages":"338-349"},"paperAbstract":"Twitter as a new form of social media can potentially contain much useful information, but content analysis on Twitter has not been well studied. In particular, it is not clear whether as an information source Twitter can be simply regarded as a faster news feed that covers mostly the same information as traditional news media. In This paper we empirically compare the content of Twitter with a traditional news medium, New York Times, using unsupervised topic modeling. We use a Twitter-LDA model to discover topics from a representative sample of the entire Twitter. We then use text mining techniques to compare these Twitter topics with topics from New York Times, taking into consideration topic categories and types. We also study the relation between the proportions of opinionated tweets and retweets and topic categories and types. Our comparisons show interesting and useful findings for downstream IR or DM applications.","sourceIds":["conf/ecir/ZhaoJWHLYL11"]},{"url":"https://www.semanticscholar.org/paper/Enhanced-Sentiment-Learning-Using-Twitter-Hashtags-Davidov-Tsur/d13d4dda75802815ef6f535e834871b866686486?utm_campaign=DBLP+Prototype&utm_source=DBLP&utm_medium=Partner+API","title":"Enhanced Sentiment Learning Using Twitter Hashtags and Smileys","authors":[{"name":"Dmitry Davidov","url":"https://www.semanticscholar.org/author/Dmitry-Davidov/33406957"},{"name":"Oren Tsur","url":"https://www.semanticscholar.org/author/Oren-Tsur/1842598"},{"name":"Ari Rappoport","url":"https://www.semanticscholar.org/author/Ari-Rappoport/145009917"}],"venue":"COLING","year":2010,"stats":{"influentialCitations":38,"estimatedTotalCitations":430.0447663601264,"velocity":47.0,"acceleration":-0.32},"journal":{"pages":"241-249"},"paperAbstract":"Automated identification of diverse sentiment types can be beneficial for many NLP systems such as review summarization and public media analysis. In some of these systems there is an option of assigning a sentiment value to a single sentence or a very short text. \n \nIn this paper we propose a supervised sentiment classification framework which is based on data from Twitter, a popular microblogging service. By utilizing 50 Twitter tags and 15 smileys as sentiment labels, this framework avoids the need for labor intensive manual annotation, allowing identification and classification of diverse sentiment types of short texts. We evaluate the contribution of different feature types for sentiment classification and show that our framework successfully identifies sentiment types of untagged sentences. The quality of the sentiment identification was also confirmed by human judges. We also explore dependencies and overlap between different sentiment types represented by smileys and Twitter hashtags.","sourceIds":["conf/coling/DavidovTR10"]},{"url":"https://www.semanticscholar.org/paper/Twitter-under-crisis:-can-we-trust-what-we-RT-Mendoza-Poblete/2141a4655f65c09dce412bc9125d960b453ed64d?utm_campaign=DBLP+Prototype&utm_source=DBLP&utm_medium=Partner+API","title":"Twitter under crisis: can we trust what we RT?","authors":[{"name":"Marcelo Mendoza","url":"https://www.semanticscholar.org/author/Marcelo-Mendoza/145893609"},{"name":"Barbara Poblete","url":"https://www.semanticscholar.org/author/Barbara-Poblete/2272762"},{"name":"Carlos Castillo","url":"https://www.semanticscholar.org/author/Carlos-Castillo/145668771"}],"venue":"SOMA '10","year":2010,"stats":{"influentialCitations":48,"estimatedTotalCitations":481.81696321214963,"velocity":64.66666666666667,"acceleration":-0.26666666666666666},"journal":{"pages":"71-79"},"paperAbstract":"In this article we explore the behavior of Twitter users under an emergency situation. In particular, we analyze the activity related to the 2010 earthquake in Chile and characterize Twitter in the hours and days following this disaster. Furthermore, we perform a preliminary study of certain social phenomenons, such as the dissemination of false rumors and confirmed news. We analyze how this information propagated through the Twitter network, with the purpose of assessing the reliability of Twitter as an information source under extreme circumstances. Our analysis shows that the propagation of tweets that correspond to rumors differs from tweets that spread news because rumors tend to be questioned more than news by the Twitter community. This result shows that it is posible to detect rumors by using aggregate analysis on tweets.","sourceIds":["conf/kdd/MendozaP010"]},{"url":"https://www.semanticscholar.org/paper/Tweet,-Tweet,-Retweet:-Conversational-Aspects-of-on-Boyd-Golder/712b45e292ea9b9ba98eaa79935f9d1aaef45286?utm_campaign=DBLP+Prototype&utm_source=DBLP&utm_medium=Partner+API","title":"Tweet, Tweet, Retweet: Conversational Aspects of Retweeting on Twitter","authors":[{"name":"Danah Boyd","url":"https://www.semanticscholar.org/author/Danah-Boyd/38818867"},{"name":"Scott Golder","url":"https://www.semanticscholar.org/author/Scott-Golder/49410920"},{"name":"Gilad Lotan","url":"https://www.semanticscholar.org/author/Gilad-Lotan/34608437"}],"venue":"2010 43rd Hawaii International Conference on System Sciences","year":2010,"stats":{"influentialCitations":70,"estimatedTotalCitations":705.8003698168413,"velocity":85.33333333333333,"acceleration":-0.3258426966292135},"journal":{"name":"2010 43rd Hawaii International Conference on System Sciences","pages":"1-10"},"paperAbstract":"Twitter - a microblogging service that enables users to post messages (\"tweets\") of up to 140 characters - supports a variety of communicative practices; participants use Twitter to converse with individuals, groups, and the public at large, so when conversations emerge, they are often experienced by broader audiences than just the interlocutors. This paper examines the practice of retweeting as a way by which participants can be \"in a conversation.\" While retweeting has become a convention inside Twitter, participants retweet using different styles and for diverse reasons. We highlight how authorship, attribution, and communicative fidelity are negotiated in diverse ways. Using a series of case studies and empirical data, this paper maps out retweeting as a conversational practice.","sourceIds":["conf/hicss/BoydGL10"]},{"url":"https://www.semanticscholar.org/paper/What-is-Twitter,-a-social-network-or-a-news-media-Kwak-Lee/b2b057987c398ecf332f50f42891161c99e14aa4?utm_campaign=DBLP+Prototype&utm_source=DBLP&utm_medium=Partner+API","title":"What is Twitter, a social network or a news media?","authors":[{"name":"Haewoon Kwak","url":"https://www.semanticscholar.org/author/Haewoon-Kwak/2592694"},{"name":"Changhyun Lee","url":"https://www.semanticscholar.org/author/Changhyun-Lee/84161304"},{"name":"Hosung Park","url":"https://www.semanticscholar.org/author/Hosung-Park/145291985"},{"name":"Sue B. Moon","url":"https://www.semanticscholar.org/author/Sue-B.-Moon/33772810"}],"venue":"WWW '10","year":2010,"stats":{"influentialCitations":541,"estimatedTotalCitations":3234.987627803426,"velocity":403.6666666666667,"acceleration":-0.27053140096618356},"journal":{"pages":"591-600"},"paperAbstract":"Twitter, a microblogging service less than three years old, commands more than 41 million users as of July 2009 and is growing fast. Twitter users tweet about any topic within the 140-character limit and follow others to receive their tweets. The goal of this paper is to study the topological characteristics of Twitter and its power as a new medium of information sharing.\n We have crawled the entire Twitter site and obtained 41.7 million user profiles, 1.47 billion social relations, 4,262 trending topics, and 106 million tweets. In its follower-following topology analysis we have found a non-power-law follower distribution, a short effective diameter, and low reciprocity, which all mark a deviation from known characteristics of human social networks [28]. In order to identify influentials on Twitter, we have ranked users by the number of followers and by PageRank and found two rankings to be similar. Ranking by retweets differs from the previous two rankings, indicating a gap in influence inferred from the number of followers and that from the popularity of one's tweets. We have analyzed the tweets of top trending topics and reported on their temporal behavior and user participation. We have classified the trending topics based on the active period and the tweets and show that the majority (over 85%) of topics are headline news or persistent news in nature. A closer look at retweets reveals that any retweeted tweet is to reach an average of 1,000 users no matter what the number of followers is of the original tweet. Once retweeted, a tweet gets retweeted almost instantly on next hops, signifying fast diffusion of information after the 1st retweet.\n To the best of our knowledge this work is the first quantitative study on the entire Twittersphere and information diffusion on it.","sourceIds":["conf/www/KwakLPM10"]},{"url":"https://www.semanticscholar.org/paper/Earthquake-shakes-Twitter-users:-real-time-event-by-Sakaki-Okazaki/49b2a1b9606c0ccb95a36895760fc91b8b830266?utm_campaign=DBLP+Prototype&utm_source=DBLP&utm_medium=Partner+API","title":"Earthquake shakes Twitter users: real-time event detection by social sensors","authors":[{"name":"Takeshi Sakaki","url":"https://www.semanticscholar.org/author/Takeshi-Sakaki/3091472"},{"name":"Makoto Okazaki","url":"https://www.semanticscholar.org/author/Makoto-Okazaki/3045161"},{"name":"Yutaka Matsuo","url":"https://www.semanticscholar.org/author/Yutaka-Matsuo/49484314"}],"venue":"WWW '10","year":2010,"stats":{"influentialCitations":191,"estimatedTotalCitations":2277.777001426095,"velocity":262.3333333333333,"acceleration":-0.24705882352941178},"journal":{"pages":"851-860"},"paperAbstract":"Twitter, a popular microblogging service, has received much attention recently. An important characteristic of Twitter is its real-time nature. For example, when an earthquake occurs, people make many Twitter posts (tweets) related to the earthquake, which enables detection of earthquake occurrence promptly, simply by observing the tweets. As described in this paper, we investigate the real-time interaction of events such as earthquakes in Twitter and propose an algorithm to monitor tweets and to detect a target event. To detect a target event, we devise a classifier of tweets based on features such as the keywords in a tweet, the number of words, and their context. Subsequently, we produce a probabilistic spatiotemporal model for the target event that can find the center and the trajectory of the event location. We consider each Twitter user as a sensor and apply Kalman filtering and particle filtering, which are widely used for location estimation in ubiquitous/pervasive computing. The particle filter works better than other comparable methods for estimating the centers of earthquakes and the trajectories of typhoons. As an application, we construct an earthquake reporting system in Japan. Because of the numerous earthquakes and the large number of Twitter users throughout the country, we can detect an earthquake with high probability (96% of earthquakes of Japan Meteorological Agency (JMA) seismic intensity scale 3 or more are detected) merely by monitoring tweets. Our system detects earthquakes promptly and sends e-mails to registered users. Notification is delivered much faster than the announcements that are broadcast by the JMA.","sourceIds":["conf/www/SakakiOM10"]},{"url":"https://www.semanticscholar.org/paper/Twitter-Catches-The-Flu:-Detecting-Influenza-using-Aramaki-Maskawa/51853d0e2b9ca6962bd8fa1272c77811e5ad18ab?utm_campaign=DBLP+Prototype&utm_source=DBLP&utm_medium=Partner+API","title":"Twitter Catches The Flu: Detecting Influenza Epidemics using Twitter","authors":[{"name":"Eiji Aramaki","url":"https://www.semanticscholar.org/author/Eiji-Aramaki/3182818"},{"name":"Sachiko Maskawa","url":"https://www.semanticscholar.org/author/Sachiko-Maskawa/3038009"},{"name":"Mizuki Morita","url":"https://www.semanticscholar.org/author/Mizuki-Morita/48279805"}],"venue":"EMNLP","year":2011,"stats":{"influentialCitations":31,"estimatedTotalCitations":358.23593918858154,"velocity":47.0,"acceleration":-0.24489795918367346},"journal":{"pages":"1568-1576"},"paperAbstract":"With the recent rise in popularity and scale of social media, a growing need exists for systems that can extract useful information from huge amounts of data. We address the issue of detecting influenza epidemics. First, the proposed system extracts influenza related tweets using Twitter API. Then, only tweets that mention actual influenza patients are extracted by the support vector machine (SVM) based classifier. The experiment results demonstrate the feasibility of the proposed approach (0.89 correlation to the gold standard). Especially at the outbreak and early spread (early epidemic stage), the proposed method shows high correlation (0.97 correlation), which outperforms the state-of-the-art methods. This paper describes that Twitter texts reflect the real world, and that NLP techniques can be applied to extract only tweets that contain useful information.","sourceIds":["conf/emnlp/AramakiMM11"]},{"url":"https://www.semanticscholar.org/paper/TwitterRank:-finding-topic-sensitive-influential-Weng-Lim/2b08e709c086c9eed4b4d2672351831712231c6f?utm_campaign=DBLP+Prototype&utm_source=DBLP&utm_medium=Partner+API","title":"TwitterRank: finding topic-sensitive influential twitterers","authors":[{"name":"Jianshu Weng","url":"https://www.semanticscholar.org/author/Jianshu-Weng/1974162"},{"name":"Ee-Peng Lim","url":"https://www.semanticscholar.org/author/Ee-Peng-Lim/1709901"},{"name":"Jing Jiang","url":"https://www.semanticscholar.org/author/Jing-Jiang/144924150"},{"name":"Qi He","url":"https://www.semanticscholar.org/author/Qi-He/145109822"}],"venue":"WSDM '10","year":2010,"stats":{"influentialCitations":147,"estimatedTotalCitations":1120.9875457866353,"velocity":117.0,"acceleration":-0.3880597014925373},"journal":{"pages":"261-270"},"paperAbstract":"This paper focuses on the problem of identifying influential users of micro-blogging services. Twitter, one of the most notable micro-blogging services, employs a social-networking model called \"following\", in which each user can choose who she wants to \"follow\" to receive tweets from without requiring the latter to give permission first. In a dataset prepared for this study, it is observed that (1) 72.4% of the users in Twitter follow more than 80% of their followers, and (2) 80.5% of the users have 80% of users they are following follow them back. Our study reveals that the presence of \"reciprocity\" can be explained by phenomenon of homophily. Based on this finding, TwitterRank, an extension of PageRank algorithm, is proposed to measure the influence of users in Twitter. TwitterRank measures the influence taking both the topical similarity between users and the link structure into account. Experimental results show that TwitterRank outperforms the one Twitter currently uses and other related algorithms, including the original PageRank and Topic-sensitive PageRank.","sourceIds":["conf/wsdm/WengLJH10"]},{"url":"https://www.semanticscholar.org/paper/Twitter-as-a-Corpus-for-Sentiment-Analysis-and-Pak-Paroubek/6b7fc158541d5a7be2b2465f7d8a42afa97d7ae9?utm_campaign=DBLP+Prototype&utm_source=DBLP&utm_medium=Partner+API","title":"Twitter as a Corpus for Sentiment Analysis and Opinion Mining","authors":[{"name":"Alexander Pak","url":"https://www.semanticscholar.org/author/Alexander-Pak/116265825"},{"name":"Patrick Paroubek","url":"https://www.semanticscholar.org/author/Patrick-Paroubek/2552801"}],"venue":"LREC","year":2010,"stats":{"influentialCitations":44,"estimatedTotalCitations":404.46750283445783,"velocity":48.0,"acceleration":-0.10416666666666667},"paperAbstract":"Microblogging today has become a very popular communication tool among Internet users. Millions of users share opinions on different aspects of life everyday. Therefore microblogging web-sites are rich sources of data for opinion mining and sentiment analysis. Because microblogging has appeared relatively recently, there are a few research works that were devoted to this topic. In our paper, we focus on using Twitter, the most popular microblogging platform, for the task of sentiment analysis. We show how to automatically collect a corpus for sentiment analysis and opinion mining purposes. We perform linguistic analysis of the collected corpus and explain discovered phenomena. Using the corpus, we build a sentiment classifier, that is able to determine positive, negative and neutral sentiments for a document. Experimental evaluations show that our proposed techniques are efficient and performs better than previously proposed methods. In our research, we worked with English, however, the proposed technique can be used with any other language.","sourceIds":["conf/lrec/PakP10"]},{"url":"https://www.semanticscholar.org/paper/Measuring-User-Influence-in-Twitter:-The-Million-Cha-Haddadi/1ad8410d0ded269af4a0116d8b38842a7549f0ae?utm_campaign=DBLP+Prototype&utm_source=DBLP&utm_medium=Partner+API","title":"Measuring User Influence in Twitter: The Million Follower Fallacy","authors":[{"name":"Meeyoung Cha","url":"https://www.semanticscholar.org/author/Meeyoung-Cha/1775511"},{"name":"Hamed Haddadi","url":"https://www.semanticscholar.org/author/Hamed-Haddadi/1763096"},{"name":"Fabrício Benevenuto","url":"https://www.semanticscholar.org/author/Fabrício-Benevenuto/1869561"},{"name":"Krishna P. Gummadi","url":"https://www.semanticscholar.org/author/Krishna-P.-Gummadi/1958921"}],"venue":"ICWSM","year":2010,"stats":{"influentialCitations":213,"estimatedTotalCitations":1548.0347539359773,"velocity":174.0,"acceleration":-0.38421052631578945},"paperAbstract":"Directed links in social media could represent anything from intimate friendships to common interests, or even a passion for breaking news or celebrity gossip. Such directed links determine the flow of information and hence indicate a user's influence on others — a concept that is crucial in sociology and viral marketing. In this paper, using a large amount of data collected from Twitter, we present an in-depth comparison of three measures of influence: indegree, retweets, and mentions. Based on these measures, we investigate the dynamics of user influence across topics and time. We make several interesting observations. First, popular users who have high indegree are not necessarily influential in terms of spawning retweets or mentions. Second, most influential users can hold significant influence over a variety of topics. Third, influence is not gained spontaneously or accidentally, but through concerted effort such as limiting tweets to a single topic. We believe that these findings provide new insights for viral marketing and suggest that topological measures such as indegree alone reveals very little about the influence of a user.","sourceIds":["conf/icwsm/ChaHBG10"]},{"url":"https://www.semanticscholar.org/paper/Sentiment-Knowledge-Discovery-in-Twitter-Streaming-Bifet-Frank/f234c3aab4e3817cafa44051d7bd1aebc9cd394b?utm_campaign=DBLP+Prototype&utm_source=DBLP&utm_medium=Partner+API","title":"Sentiment Knowledge Discovery in Twitter Streaming Data","authors":[{"name":"Albert Bifet","url":"https://www.semanticscholar.org/author/Albert-Bifet/1762931"},{"name":"Eibe Frank","url":"https://www.semanticscholar.org/author/Eibe-Frank/143713826"}],"venue":"Discovery Science","year":2010,"stats":{"influentialCitations":38,"estimatedTotalCitations":290.63482004091946,"velocity":37.666666666666664,"acceleration":-0.38095238095238093},"journal":{"pages":"1-15"},"paperAbstract":"Micro-blogs are a challenging new source of information for data mining techniques. Twitter is a micro-blogging service built to discover what is happening at any moment in time, anywhere in the world. Twitter messages are short, and generated constantly, and well suited for knowledge discovery using data stream mining. We briefly discuss the challenges that Twitter data streams pose, focusing on classification problems, and then consider these streams for opinion mining and sentiment analysis. To deal with streaming unbalanced classes, we propose a sliding window Kappa statistic for evaluation in time-changing data streams. Using this statistic we perform a study on Twitter data using learning algorithms for data streams.","sourceIds":["conf/dis/BifetF10"]},{"url":"https://www.semanticscholar.org/paper/Twitter-power:-Tweets-as-electronic-word-of-mouth-Jansen-Zhang/fa74b8bc0543e9d1a801cbdc25e913e0e7cfe987?utm_campaign=DBLP+Prototype&utm_source=DBLP&utm_medium=Partner+API","title":"Twitter power: Tweets as electronic word of mouth","authors":[{"name":"Bernard J. Jansen","url":"https://www.semanticscholar.org/author/Bernard-J.-Jansen/144715575"},{"name":"Mimi Zhang","url":"https://www.semanticscholar.org/author/Mimi-Zhang/7979346"},{"name":"Kate Sobel","url":"https://www.semanticscholar.org/author/Kate-Sobel/2284213"},{"name":"Abdur Chowdhury","url":"https://www.semanticscholar.org/author/Abdur-Chowdhury/144826077"}],"venue":"J. Assoc. Inf. Sci. Technol.","year":2009,"stats":{"influentialCitations":66,"estimatedTotalCitations":768.702209879471,"velocity":91.0,"acceleration":-0.3333333333333333},"journal":{"name":"J. Assoc. Inf. Sci. Technol.","volume":"60","pages":"2169-2188"},"paperAbstract":"In this paper we report research results investigating microblogging as a form of electronic word-of-mouth for sharing consumer opinions concerning brands. We analyzed more than 150,000 microblog postings containing branding comments, sentiments, and opinions.We investigated the overall structure of these microblog postings, the types of expressions, and the movement in positive or negative sentiment.We compared automated methods of classifying sentiment in these microblogs with manual coding. Using a case study approach, we analyzed the range, frequency, timing, and content of tweets in a corporate account. Our research findings show that 19% of microblogs contain mention of a brand. Of the branding microblogs, nearly 20% contained some expression of brand sentiments. Of these, more than 50% were positive and 33% were critical of the company or product. Our comparison of automated and manual coding showed no significant differences between the two approaches. In analyzing microblogs for structure and composition, the linguistic structure of tweets approximate the linguistic patterns of natural language expressions. We find that microblogging is an online tool for customer word of mouth communications and discuss the implications for corporations using microblogging as part of their overall marketing strategy.","sourceIds":["journals/jasis/JansenZSC09"]},{"url":"https://www.semanticscholar.org/paper/Characterizing-debate-performance-via-aggregated-Diakopoulos-Shamma/8b6d3359f61299db648e1b98efb41bf0d56bf912?utm_campaign=DBLP+Prototype&utm_source=DBLP&utm_medium=Partner+API","title":"Characterizing debate performance via aggregated twitter sentiment","authors":[{"name":"Nicholas Diakopoulos","url":"https://www.semanticscholar.org/author/Nicholas-Diakopoulos/2943892"},{"name":"David A. Shamma","url":"https://www.semanticscholar.org/author/David-A.-Shamma/1760364"}],"venue":"CHI","year":2010,"stats":{"influentialCitations":23,"estimatedTotalCitations":268.759132751112,"velocity":23.333333333333332,"acceleration":0.047619047619047616},"journal":{"pages":"1195-1198"},"paperAbstract":"Television broadcasters are beginning to combine social micro-blogging systems such as Twitter with television to create social video experiences around events. We looked at one such event, the first U.S. presidential debate in 2008, in conjunction with aggregated ratings of message sentiment from Twitter. We begin to develop an analytical methodology and visual representations that could help a journalist or public affairs person better understand the temporal dynamics of sentiment in reaction to the debate video. We demonstrate visuals and metrics that can be used to detect sentiment pulse, anomalies in that pulse, and indications of controversial topics that can be used to inform the design of visual analytic systems for social media events.","sourceIds":["conf/chi/DiakopoulosS10"]},{"url":"https://www.semanticscholar.org/paper/Modeling-Public-Mood-and-Emotion:-Twitter-Sentiment-Bollen-Mao/6298da6bfa0528bba0ffaf70e0dbe9ed223ce08f?utm_campaign=DBLP+Prototype&utm_source=DBLP&utm_medium=Partner+API","title":"Modeling Public Mood and Emotion: Twitter Sentiment and Socio-Economic Phenomena","authors":[{"name":"Johan Bollen","url":"https://www.semanticscholar.org/author/Johan-Bollen/1756468"},{"name":"Huina Mao","url":"https://www.semanticscholar.org/author/Huina-Mao/12145107"},{"name":"Alberto Pepe","url":"https://www.semanticscholar.org/author/Alberto-Pepe/35632500"}],"venue":"ICWSM","year":2011,"stats":{"influentialCitations":52,"estimatedTotalCitations":548.5557343866041,"velocity":69.66666666666667,"acceleration":-0.3375},"journal":{"name":"ArXiv","volume":"abs/0911.1583"},"paperAbstract":"We perform a sentiment analysis of all tweets published on the microblogging platform Twitter in the second half of 2008. We use a psychometric instrument to extract six mood states (tension, depression, anger, vigor, fatigue, confusion) from the aggregated Twitter content and compute a six-dimensional mood vector for each day in the timeline. We compare our results to a record of popular events gathered from media and sources. We find that events in the social, political, cultural and economic sphere do have a significant, immediate and highly specific effect on the various dimensions of public mood. We speculate that large scale analyses of mood can provide a solid platform to model collective emotive trends in terms of their predictive value with regards to existing social as well as economic indicators.","sourceIds":["conf/icwsm/BollenMP11","journals/corr/abs-0911-1583"]},{"url":"https://www.semanticscholar.org/paper/You-are-where-you-tweet:-a-content-based-approach-Cheng-Caverlee/e82dfb1fdadf880e62495429928541d918dfea37?utm_campaign=DBLP+Prototype&utm_source=DBLP&utm_medium=Partner+API","title":"You are where you tweet: a content-based approach to geo-locating twitter users","authors":[{"name":"Zhiyuan Cheng","url":"https://www.semanticscholar.org/author/Zhiyuan-Cheng/35098891"},{"name":"James Caverlee","url":"https://www.semanticscholar.org/author/James-Caverlee/1697232"},{"name":"Kyumin Lee","url":"https://www.semanticscholar.org/author/Kyumin-Lee/2848353"}],"venue":"CIKM '10","year":2010,"stats":{"influentialCitations":105,"estimatedTotalCitations":688.1911382198213,"velocity":88.0,"acceleration":-0.2967032967032967},"journal":{"pages":"759-768"},"paperAbstract":"We propose and evaluate a probabilistic framework for estimating a Twitter user's city-level location based purely on the content of the user's tweets, even in the absence of any other geospatial cues. By augmenting the massive human-powered sensing capabilities of Twitter and related microblogging services with content-derived location information, this framework can overcome the sparsity of geo-enabled features in these services and enable new location-based personalized information services, the targeting of regional advertisements, and so on. Three of the key features of the proposed approach are: (i) its reliance purely on tweet content, meaning no need for user IP information, private login information, or external knowledge bases; (ii) a classification component for automatically identifying words in tweets with a strong local geo-scope; and (iii) a lattice-based neighborhood smoothing model for refining a user's location estimate. The system estimates k possible locations for each user in descending order of confidence. On average we find that the location estimates converge quickly (needing just 100s of tweets), placing 51% of Twitter users within 100 miles of their actual location.","sourceIds":["conf/cikm/ChengCL10"]},{"url":"https://www.semanticscholar.org/paper/Classifying-latent-user-attributes-in-twitter-Rao-Yarowsky/740f183eb134f75cb943fa9ae0bac97366c9cdcf?utm_campaign=DBLP+Prototype&utm_source=DBLP&utm_medium=Partner+API","title":"Classifying latent user attributes in twitter","authors":[{"name":"Delip Rao","url":"https://www.semanticscholar.org/author/Delip-Rao/48810734"},{"name":"David Yarowsky","url":"https://www.semanticscholar.org/author/David-Yarowsky/1693517"},{"name":"Abhishek Shreevats","url":"https://www.semanticscholar.org/author/Abhishek-Shreevats/2501544"},{"name":"Manaswi Gupta","url":"https://www.semanticscholar.org/author/Manaswi-Gupta/2827995"}],"venue":"SMUC '10","year":2010,"stats":{"influentialCitations":76,"estimatedTotalCitations":409.37958425292726,"velocity":57.333333333333336,"acceleration":-0.2777777777777778},"journal":{"pages":"37-44"},"paperAbstract":"Social media outlets such as Twitter have become an important forum for peer interaction. Thus the ability to classify latent user attributes, including gender, age, regional origin, and political orientation solely from Twitter user language or similar highly informal content has important applications in advertising, personalization, and recommendation. This paper includes a novel investigation of stacked-SVM-based classification algorithms over a rich set of original features, applied to classifying these four user attributes. It also includes extensive analysis of features and approaches that are effective and not effective in classifying user attributes in Twitter-style informal written genres as distinct from the other primarily spoken genres previously studied in the user-property classification literature. Our models, singly and in ensemble, significantly outperform baseline models in all cases. A detailed analysis of model components and features provides an often entertaining insight into distinctive language-usage variation across gender, age, regional origin and political orientation in modern informal communication.","sourceIds":["conf/cikm/RaoYSG10"]},{"url":"https://www.semanticscholar.org/paper/Want-to-be-Retweeted-Large-Scale-Analytics-on-in-Suh-Hong/ddb3324ec2afeabea6755199aef1af2788b4b1a9?utm_campaign=DBLP+Prototype&utm_source=DBLP&utm_medium=Partner+API","title":"Want to be Retweeted? Large Scale Analytics on Factors Impacting Retweet in Twitter Network","authors":[{"name":"Bongwon Suh","url":"https://www.semanticscholar.org/author/Bongwon-Suh/3994427"},{"name":"Lichan Hong","url":"https://www.semanticscholar.org/author/Lichan-Hong/2217278"},{"name":"Peter Pirolli","url":"https://www.semanticscholar.org/author/Peter-Pirolli/144980333"},{"name":"Ed Huai-hsin Chi","url":"https://www.semanticscholar.org/author/Ed-Huai-hsin-Chi/2226805"}],"venue":"2010 IEEE Second International Conference on Social Computing","year":2010,"stats":{"influentialCitations":82,"estimatedTotalCitations":527.061186811749,"velocity":71.66666666666667,"acceleration":-0.44},"journal":{"name":"2010 IEEE Second International Conference on Social Computing","pages":"177-184"},"paperAbstract":"Retweeting is the key mechanism for information diffusion in Twitter. It emerged as a simple yet powerful way of disseminating information in the Twitter social network. Even though a lot of information is shared in Twitter, little is known yet about how and why certain information spreads more widely than others. In this paper, we examine a number of features that might affect retweetability of tweets. We gathered content and contextual features from 74M tweets and used this data set to identify factors that are significantly associated with retweet rate. We also built a predictive retweet model. We found that, amongst content features, URLs and hashtags have strong relationships with retweetability. Amongst contextual features, the number of followers and followees as well as the age of the account seem to affect retweetability, while, interestingly, the number of past tweets does not predict retweetability of a user's tweet. We believe that this research would inform the design of sensemaking and analytics tools for social media streams.","sourceIds":["conf/socialcom/SuhHPC10"]},{"url":"https://www.semanticscholar.org/paper/Predicting-Elections-with-Twitter:-What-140-Reveal-Tumasjan-Sprenger/3e4a35ced9f7f81179028671b09129efae988baf?utm_campaign=DBLP+Prototype&utm_source=DBLP&utm_medium=Partner+API","title":"Predicting Elections with Twitter: What 140 Characters Reveal about Political Sentiment","authors":[{"name":"Andranik Tumasjan","url":"https://www.semanticscholar.org/author/Andranik-Tumasjan/2584292"},{"name":"Timm Oliver Sprenger","url":"https://www.semanticscholar.org/author/Timm-Oliver-Sprenger/2469729"},{"name":"Philipp G. Sandner","url":"https://www.semanticscholar.org/author/Philipp-G.-Sandner/34979132"},{"name":"Isabell M. Welpe","url":"https://www.semanticscholar.org/author/Isabell-M.-Welpe/2977208"}],"venue":"ICWSM","year":2010,"stats":{"influentialCitations":114,"estimatedTotalCitations":1200.4243212087836,"velocity":178.66666666666666,"acceleration":-0.3107344632768362},"paperAbstract":"Twitter is a microblogging website where users read and write millions of short messages on a variety of topics every day. This study uses the context of the German federal election to investigate whether Twitter is used as a forum for political deliberation and whether online messages on Twitter validly mirror offline political sentiment. Using LIWC text analysis software, we conducted a content-analysis of over 100,000 messages containing a reference to either a political party or a politician. Our results show that Twitter is indeed used extensively for political deliberation. We find that the mere number of messages mentioning a party reflects the election result. Moreover, joint mentions of two parties are in line with real world political ties and coalitions. An analysis of the tweets’ political sentiment demonstrates close correspondence to the parties' and politicians’ political positions indicating that the content of Twitter messages plausibly reflects the offline political landscape. We discuss the use of microblogging message content as a valid indicator of political sentiment and derive suggestions for further research.","sourceIds":["conf/icwsm/TumasjanSSW10"]},{"url":"https://www.semanticscholar.org/paper/Our-Twitter-Profiles,-Our-Selves:-Predicting-with-Quercia-Kosinski/04a355c76146ea28e87de16fb0df3761b264c9eb?utm_campaign=DBLP+Prototype&utm_source=DBLP&utm_medium=Partner+API","title":"Our Twitter Profiles, Our Selves: Predicting Personality with Twitter","authors":[{"name":"Daniele Quercia","url":"https://www.semanticscholar.org/author/Daniele-Quercia/144041798"},{"name":"Michal Kosinski","url":"https://www.semanticscholar.org/author/Michal-Kosinski/2654865"},{"name":"David Stillwell","url":"https://www.semanticscholar.org/author/David-Stillwell/2567132"},{"name":"Jon Crowcroft","url":"https://www.semanticscholar.org/author/Jon-Crowcroft/144334554"}],"venue":"2011 IEEE Third Int'l Conference on Privacy, Security, Risk and Trust and 2011 IEEE Third Int'l Conference on Social Computing","year":2011,"stats":{"influentialCitations":46,"estimatedTotalCitations":258.8296499550202,"velocity":37.333333333333336,"acceleration":0.058823529411764705},"journal":{"name":"2011 IEEE Third Int'l Conference on Privacy, Security, Risk and Trust and 2011 IEEE Third Int'l Conference on Social Computing","pages":"180-185"},"paperAbstract":"Psychological personality has been shown to affect a variety of aspects: preferences for interaction styles in the digital world and for music genres, for example. Consequently, the design of personalized user interfaces and music recommender systems might benefit from understanding the relationship between personality and use of social media. Since there has not been a study between personality and use of Twitter at large, we set out to analyze the relationship between personality and different types of Twitter users, including popular users and influentials. For 335 users, we gather personality data, analyze it, and find that both popular users and influentials are extroverts and emotionally stable (low in the trait of Neuroticism). Interestingly, we also find that popular users are `imaginative' (high in Openness), while influentials tend to be `organized' (high in Conscientiousness). We then show a way of accurately predicting a user's personality simply based on three counts publicly available on profiles: following, followers, and listed counts. Knowing these three quantities about an active user, one can predict the user's five personality traits with a root-mean-squared error below 0.88 on a $[1,5]$ scale. Based on these promising results, we argue that being able to predict user personality goes well beyond our initial goal of informing the design of new personalized applications as it, for example, expands current studies on privacy in social media.","sourceIds":["conf/socialcom/QuerciaKSC11"]},{"url":"https://www.semanticscholar.org/paper/Detecting-influenza-outbreaks-by-analyzing-Twitter-Culotta/f85d856109a3c1f8dc017f11e5e88ed29de1bf00?utm_campaign=DBLP+Prototype&utm_source=DBLP&utm_medium=Partner+API","title":"Detecting influenza outbreaks by analyzing Twitter messages","authors":[{"name":"Aron Culotta","url":"https://www.semanticscholar.org/author/Aron-Culotta/1741453"}],"venue":"ArXiv","year":2010,"stats":{"influentialCitations":10,"estimatedTotalCitations":72.14208327157948,"velocity":6.666666666666667},"journal":{"name":"ArXiv","volume":"abs/1007.4748"},"paperAbstract":"We analyze over 500 million Twitter messages from an eight month period and find that tracking a small number of flu-related keywords allows us to forecast future influenza rates with high accuracy, obtaining a 95% correlation with national health statistics. We then analyze the robustness of this approach to spurious keyword matches, and we propose a document classification component to filter these misleading messages. We find that this document classifier can reduce error rates by over half in simulated false alarm experiments, though more research is needed to develop methods that are robust in cases of extremely high noise.","sourceIds":["journals/corr/abs-1007-4748"]},{"url":"https://www.semanticscholar.org/paper/Who-says-what-to-whom-on-twitter-Wu-Hofman/e53fde0e51b578767e6f4876ef7f09633fba7e7a?utm_campaign=DBLP+Prototype&utm_source=DBLP&utm_medium=Partner+API","title":"Who says what to whom on twitter","authors":[{"name":"Shaomei Wu","url":"https://www.semanticscholar.org/author/Shaomei-Wu/1968133"},{"name":"Jake M. Hofman","url":"https://www.semanticscholar.org/author/Jake-M.-Hofman/40368603"},{"name":"Winter A. Mason","url":"https://www.semanticscholar.org/author/Winter-A.-Mason/47787843"},{"name":"Duncan J. Watts","url":"https://www.semanticscholar.org/author/Duncan-J.-Watts/1783914"}],"venue":"WWW","year":2011,"stats":{"influentialCitations":35,"estimatedTotalCitations":377.933340896931,"velocity":37.666666666666664,"acceleration":-0.36585365853658536},"journal":{"pages":"705-714"},"paperAbstract":"We study several longstanding questions in media communications research, in the context of the microblogging service Twitter, regarding the production, flow, and consumption of information. To do so, we exploit a recently introduced feature of Twitter known as \"lists\" to distinguish between elite users - by which we mean celebrities, bloggers, and representatives of media outlets and other formal organizations - and ordinary users. Based on this classification, we find a striking concentration of attention on Twitter, in that roughly 50% of URLs consumed are generated by just 20K elite users, where the media produces the most information, but celebrities are the most followed. We also find significant homophily within categories: celebrities listen to celebrities, while bloggers listen to bloggers etc; however, bloggers in general rebroadcast more information than the other categories. Next we re-examine the classical \"two-step flow\" theory of communications, finding considerable support for it on Twitter. Third, we find that URLs broadcast by different categories of users or containing different types of content exhibit systematically different lifespans. And finally, we examine the attention paid by the different user categories to different news topics.","sourceIds":["conf/www/WuHMW11"]},{"url":"https://www.semanticscholar.org/paper/Identifying-Sarcasm-in-Twitter:-A-Closer-Look-Gonz%C3%A1lez-Ib%C3%A1%C3%B1ez-Muresan/55e36d6b45c91a0daa49234bd47b856470d6825c?utm_campaign=DBLP+Prototype&utm_source=DBLP&utm_medium=Partner+API","title":"Identifying Sarcasm in Twitter: A Closer Look","authors":[{"name":"Roberto I. González-Ibáñez","url":"https://www.semanticscholar.org/author/Roberto-I.-González-Ibáñez/1398275867"},{"name":"Smaranda Muresan","url":"https://www.semanticscholar.org/author/Smaranda-Muresan/2295928"},{"name":"Nina Wacholder","url":"https://www.semanticscholar.org/author/Nina-Wacholder/2468444"}],"venue":"ACL","year":2011,"stats":{"influentialCitations":45,"estimatedTotalCitations":274.47476041993195,"velocity":50.0,"acceleration":-0.08695652173913043},"journal":{"pages":"581-586"},"paperAbstract":"Sarcasm transforms the polarity of an apparently positive or negative utterance into its opposite. We report on a method for constructing a corpus of sarcastic Twitter messages in which determination of the sarcasm of each message has been made by its author. We use this reliable corpus to compare sarcastic utterances in Twitter to utterances that express positive or negative attitudes without sarcasm. We investigate the impact of lexical and pragmatic factors on machine learning effectiveness for identifying sarcastic utterances and we compare the performance of machine learning techniques and human judges on this task. Perhaps unsurprisingly, neither the human judges nor the machine learning techniques perform very well.","sourceIds":["conf/acl/Gonzalez-IbanezMW11"]},{"url":"https://www.semanticscholar.org/paper/Understanding-the-Demographics-of-Twitter-Users-Mislove-Lehmann/06b50b893dd4b142a4059f3250bb876d61dd205e?utm_campaign=DBLP+Prototype&utm_source=DBLP&utm_medium=Partner+API","title":"Understanding the Demographics of Twitter Users","authors":[{"name":"Alan Mislove","url":"https://www.semanticscholar.org/author/Alan-Mislove/1729928"},{"name":"Sune Lehmann","url":"https://www.semanticscholar.org/author/Sune-Lehmann/31413949"},{"name":"Yong-Yeol Ahn","url":"https://www.semanticscholar.org/author/Yong-Yeol-Ahn/36663090"},{"name":"Jukka-Pekka Onnela","url":"https://www.semanticscholar.org/author/Jukka-Pekka-Onnela/50069560"},{"name":"J. Niels Rosenquist","url":"https://www.semanticscholar.org/author/J.-Niels-Rosenquist/145094478"}],"venue":"ICWSM","year":2011,"stats":{"influentialCitations":33,"estimatedTotalCitations":350.1120891152583,"velocity":61.333333333333336,"acceleration":0.018867924528301886},"paperAbstract":"Every second, the thoughts and feelings of millions of people across the world are recorded in the form of 140-character tweets using Twitter. However, despite the enormous potential presented by this remarkable data source, we still do not have an understanding of the Twitter population itself: Who are the Twitter users? How representative of the overall population are they? In this paper, we take the first steps towards answering these questions by analyzing data on a set of Twitter users representing over 1% of the U.S. population. We develop techniques that allow us to compare the Twitter population to the U.S. population along three axes (geography, gender, and race/ethnicity), and find that the Twitter population is a highly non-uniform sample of the population.","sourceIds":["conf/icwsm/MisloveLAOR11"]},{"url":"https://www.semanticscholar.org/paper/Predicting-Personality-from-Twitter-Golbeck-Robles/491e54f8f916fa544616bca3d34b6f8e37af0bcd?utm_campaign=DBLP+Prototype&utm_source=DBLP&utm_medium=Partner+API","title":"Predicting Personality from Twitter","authors":[{"name":"Jennifer Golbeck","url":"https://www.semanticscholar.org/author/Jennifer-Golbeck/1713898"},{"name":"Cristina Robles","url":"https://www.semanticscholar.org/author/Cristina-Robles/145244342"},{"name":"Michon Edmondson","url":"https://www.semanticscholar.org/author/Michon-Edmondson/32338533"},{"name":"Karen Turner","url":"https://www.semanticscholar.org/author/Karen-Turner/48318401"}],"venue":"2011 IEEE Third Int'l Conference on Privacy, Security, Risk and Trust and 2011 IEEE Third Int'l Conference on Social Computing","year":2011,"stats":{"influentialCitations":46,"estimatedTotalCitations":278.7238506841161,"velocity":42.0,"acceleration":-0.2127659574468085},"journal":{"name":"2011 IEEE Third Int'l Conference on Privacy, Security, Risk and Trust and 2011 IEEE Third Int'l Conference on Social Computing","pages":"149-156"},"paperAbstract":"Social media is a place where users present themselves to the world, revealing personal details and insights into their lives. We are beginning to understand how some of this information can be utilized to improve the users' experiences with interfaces and with one another. In this paper, we are interested in the personality of users. Personality has been shown to be relevant to many types of interactions, it has been shown to be useful in predicting job satisfaction, professional and romantic relationship success, and even preference for different interfaces. Until now, to accurately gauge users' personalities, they needed to take a personality test. This made it impractical to use personality analysis in many social media domains. In this paper, we present a method by which a user's personality can be accurately predicted through the publicly available information on their Twitter profile. We will describe the type of data collected, our methods of analysis, and the machine learning techniques that allow us to successfully predict personality. We then discuss the implications this has for social media design, interface design, and broader domains.","sourceIds":["conf/socialcom/GolbeckRET11"]},{"url":"https://www.semanticscholar.org/paper/Quantifying-Mental-Health-Signals-in-Twitter-Coppersmith-Dredze/c126d3bc35155b49eaffc8c6cf0dbb897d70d476?utm_campaign=DBLP+Prototype&utm_source=DBLP&utm_medium=Partner+API","title":"Quantifying Mental Health Signals in Twitter","authors":[{"name":"Glen Coppersmith","url":"https://www.semanticscholar.org/author/Glen-Coppersmith/4366352"},{"name":"Mark Dredze","url":"https://www.semanticscholar.org/author/Mark-Dredze/1782853"},{"name":"Craig Harman","url":"https://www.semanticscholar.org/author/Craig-Harman/145411141"}],"venue":"CLPsych@ACL","year":2014,"stats":{"influentialCitations":29,"estimatedTotalCitations":184.04959099525894,"velocity":48.0,"acceleration":0.2222222222222222},"journal":{"pages":"51-60"},"paperAbstract":"The ubiquity of social media provides a rich opportunity to enhance the data available to mental health clinicians and researchers, enabling a better-informed and better-equipped mental health field. We present analysis of mental health phenomena in publicly available Twitter data, demonstrating how rigorous application of simple natural language processing methods can yield insight into specific disorders as well as mental health writ large, along with evidence that as-of-yet undiscovered linguistic signals relevant to mental health exist in social media. We present a novel method for gathering data for a range of mental illnesses quickly and cheaply, then focus on analysis of four in particular: post-traumatic stress disorder (PTSD), depression, bipolar disorder, and seasonal affective disorder (SAD). We intend for these proof-of-concept results to inform the necessary ethical discussion regarding the balance between the utility of such data and the privacy of mental health related information.","sourceIds":["conf/acl-clpsych/CoppersmithDH14"]},{"url":"https://www.semanticscholar.org/paper/Discriminating-Gender-on-Twitter-Burger-Henderson/938ac3f1f312a1f22e2a0a73a6eb246595b0d223?utm_campaign=DBLP+Prototype&utm_source=DBLP&utm_medium=Partner+API","title":"Discriminating Gender on Twitter","authors":[{"name":"John D. Burger","url":"https://www.semanticscholar.org/author/John-D.-Burger/5416402"},{"name":"John C. Henderson","url":"https://www.semanticscholar.org/author/John-C.-Henderson/145035103"},{"name":"George Kim","url":"https://www.semanticscholar.org/author/George-Kim/46814354"},{"name":"Guido Zarrella","url":"https://www.semanticscholar.org/author/Guido-Zarrella/2983465"}],"venue":"EMNLP","year":2011,"stats":{"influentialCitations":52,"estimatedTotalCitations":391.1435725345418,"velocity":63.0,"acceleration":-0.17857142857142858},"journal":{"pages":"1301-1309"},"paperAbstract":"Accurate prediction of demographic attributes from social media and other informal online content is valuable for marketing, personalization, and legal investigation. This paper describes the construction of a large, multilingual dataset labeled with gender, and investigates statistical models for determining the gender of uncharacterized Twitter users. We explore several different classifier types on this dataset. We show the degree to which classifier accuracy varies based on tweet volumes as well as when various kinds of profile metadata are included in the models. We also perform a large-scale human assessment using Amazon Mechanical Turk. Our methods significantly out-perform both baseline models and almost all humans on the same task.","sourceIds":["conf/emnlp/BurgerHKZ11"]},{"url":"https://www.semanticscholar.org/paper/How-and-why-people-Twitter:-the-role-that-plays-in-Zhao-Rosson/c473cebc334ba5bc3b11beeaff6f9d772d0e9b89?utm_campaign=DBLP+Prototype&utm_source=DBLP&utm_medium=Partner+API","title":"How and why people Twitter: the role that micro-blogging plays in informal communication at work","authors":[{"name":"Dejin Zhao","url":"https://www.semanticscholar.org/author/Dejin-Zhao/2830828"},{"name":"Mary Beth Rosson","url":"https://www.semanticscholar.org/author/Mary-Beth-Rosson/1715072"}],"venue":"GROUP '09","year":2009,"stats":{"influentialCitations":47,"estimatedTotalCitations":455.5775391920372,"velocity":25.666666666666668,"acceleration":-0.4},"journal":{"pages":"243-252"},"paperAbstract":"Micro-blogs, a relatively new phenomenon, provide a new communication channel for people to broadcast information that they likely would not share otherwise using existing channels (e.g., email, phone, IM, or weblogs). Micro-blogging has become popu-lar quite quickly, raising its potential for serving as a new informal communication medium at work, providing a variety of impacts on collaborative work (e.g., enhancing information sharing, building common ground, and sustaining a feeling of connectedness among colleagues). This exploratory research project is aimed at gaining an in-depth understanding of how and why people use Twitter - a popular micro-blogging tool - and exploring micro-blog's poten-tial impacts on informal communication at work.","sourceIds":["conf/group/ZhaoR09"]},{"url":"https://www.semanticscholar.org/paper/Microblogging-during-two-natural-hazards-events:-to-Vieweg-Hughes/51ddf8e1bb6cedcea7440419b591fa5f81aaee3d?utm_campaign=DBLP+Prototype&utm_source=DBLP&utm_medium=Partner+API","title":"Microblogging during two natural hazards events: what twitter may contribute to situational awareness","authors":[{"name":"Sarah Vieweg","url":"https://www.semanticscholar.org/author/Sarah-Vieweg/3681090"},{"name":"Amanda Lee Hughes","url":"https://www.semanticscholar.org/author/Amanda-Lee-Hughes/2523772"},{"name":"Kate Starbird","url":"https://www.semanticscholar.org/author/Kate-Starbird/3181624"},{"name":"Leysia Palen","url":"https://www.semanticscholar.org/author/Leysia-Palen/1759447"}],"venue":"CHI","year":2010,"stats":{"influentialCitations":67,"estimatedTotalCitations":722.3758781955252,"velocity":98.66666666666667,"acceleration":-0.10416666666666667},"journal":{"pages":"1079-1088"},"paperAbstract":"We analyze microblog posts generated during two recent, concurrent emergency events in North America via Twitter, a popular microblogging service. We focus on communications broadcast by people who were \"on the ground\" during the Oklahoma Grassfires of April 2009 and the Red River Floods that occurred in March and April 2009, and identify information that may contribute to enhancing situational awareness (SA). This work aims to inform next steps for extracting useful, relevant information during emergencies using information extraction (IE) techniques.","sourceIds":["conf/chi/ViewegHSP10"]},{"url":"https://www.semanticscholar.org/paper/Information-Contagion:-An-Empirical-Study-of-the-of-Lerman-Ghosh/ac479df5b40f774139cd97c7ddc8929711aa3d2e?utm_campaign=DBLP+Prototype&utm_source=DBLP&utm_medium=Partner+API","title":"Information Contagion: An Empirical Study of the Spread of News on Digg and Twitter Social Networks","authors":[{"name":"Kristina Lerman","url":"https://www.semanticscholar.org/author/Kristina-Lerman/1782658"},{"name":"Rumi Ghosh","url":"https://www.semanticscholar.org/author/Rumi-Ghosh/2620560"}],"venue":"ICWSM","year":2010,"stats":{"influentialCitations":48,"estimatedTotalCitations":443.6485563240737,"velocity":57.333333333333336,"acceleration":-0.23076923076923078},"journal":{"name":"ArXiv","volume":"abs/1003.2664"},"paperAbstract":"Social networks have emerged as a critical factor in information dissemination, search, marketing, expertise and influence discovery, and potentially an important tool for mobilizing people. Social media has made social networks ubiquitous, and also given researchers access to massive quantities of data for empirical analysis. These data sets offer a rich source of evidence for studying dynamics of individual and group behavior, the structure of networks and global patterns of the flow of information on them. However, in most previous studies, the structure of the underlying networks was not directly visible but had to be inferred from the flow of information from one individual to another. As a result, we do not yet understand dynamics of information spread on networks or how the structure of the network affects it. We address this gap by analyzing data from two popular social news sites. Specifically, we extract social networks of active users on Digg and Twitter, and track how interest in news stories spreads among them. We show that social networks play a crucial role in the spread of information on these sites, and that network structure affects dynamics of information flow.","sourceIds":["conf/icwsm/LermanG10","journals/corr/abs-1003-2664"]},{"url":"https://www.semanticscholar.org/paper/Storm@twitter-Toshniwal-Taneja/edd661ca12ef8ef988679f7b399f2f846ef01fbd?utm_campaign=DBLP+Prototype&utm_source=DBLP&utm_medium=Partner+API","title":"Storm@twitter","authors":[{"name":"Ankit Toshniwal","url":"https://www.semanticscholar.org/author/Ankit-Toshniwal/98093264"},{"name":"Siddarth Taneja","url":"https://www.semanticscholar.org/author/Siddarth-Taneja/39804157"},{"name":"Amit Shukla","url":"https://www.semanticscholar.org/author/Amit-Shukla/123776882"},{"name":"Karthik Ramasamy","url":"https://www.semanticscholar.org/author/Karthik-Ramasamy/153128759"},{"name":"Jignesh M. Patel","url":"https://www.semanticscholar.org/author/Jignesh-M.-Patel/49111633"},{"name":"Sanjeev R. Kulkarni","url":"https://www.semanticscholar.org/author/Sanjeev-R.-Kulkarni/1697413"},{"name":"Jason Baird Jackson","url":"https://www.semanticscholar.org/author/Jason-Baird-Jackson/22164748"},{"name":"Krishna Gade","url":"https://www.semanticscholar.org/author/Krishna-Gade/144315468"},{"name":"Maosong Fu","url":"https://www.semanticscholar.org/author/Maosong-Fu/40434199"},{"name":"Jake Donham","url":"https://www.semanticscholar.org/author/Jake-Donham/2033444"},{"name":"Nikunj A. Bhagat","url":"https://www.semanticscholar.org/author/Nikunj-A.-Bhagat/5139705"},{"name":"Sailesh Mittal","url":"https://www.semanticscholar.org/author/Sailesh-Mittal/2550987"},{"name":"Dmitriy V. Ryaboy","url":"https://www.semanticscholar.org/author/Dmitriy-V.-Ryaboy/3128794"}],"venue":"SIGMOD Conference","year":2014,"stats":{"influentialCitations":116,"estimatedTotalCitations":328.4416264040775,"velocity":86.0,"acceleration":-0.1797752808988764},"journal":{"pages":"147-156"},"paperAbstract":"This paper describes the use of Storm at Twitter. Storm is a real-time fault-tolerant and distributed stream data processing system. Storm is currently being used to run various critical computations in Twitter at scale, and in real-time. This paper describes the architecture of Storm and its methods for distributed scale-out and fault-tolerance. This paper also describes how queries (aka. topologies) are executed in Storm, and presents some operational stories based on running Storm at Twitter. We also present results from an empirical evaluation demonstrating the resilience of Storm in dealing with machine failures. Storm is under active development at Twitter and we also present some potential directions for future work.","sourceIds":["conf/sigmod/ToshniwalTSRPKJGFDBMR14"]},{"url":"https://www.semanticscholar.org/paper/Who-is-tweeting-on-Twitter:-human,-bot,-or-cyborg-Chu-Gianvecchio/123f62c9393ebc6ecd4afad7fef474d44db9ac0f?utm_campaign=DBLP+Prototype&utm_source=DBLP&utm_medium=Partner+API","title":"Who is tweeting on Twitter: human, bot, or cyborg?","authors":[{"name":"Zi Chu","url":"https://www.semanticscholar.org/author/Zi-Chu/1735762"},{"name":"Steven Gianvecchio","url":"https://www.semanticscholar.org/author/Steven-Gianvecchio/1683031"},{"name":"Haining Wang","url":"https://www.semanticscholar.org/author/Haining-Wang/1699802"},{"name":"Sushil Jajodia","url":"https://www.semanticscholar.org/author/Sushil-Jajodia/1699357"}],"venue":"ACSAC '10","year":2010,"stats":{"influentialCitations":30,"estimatedTotalCitations":237.99054984566365,"velocity":47.333333333333336,"acceleration":-0.2},"journal":{"pages":"21-30"},"paperAbstract":"Twitter is a new web application playing dual roles of online social networking and micro-blogging. Users communicate with each other by publishing text-based posts. The popularity and open structure of Twitter have attracted a large number of automated programs, known as bots, which appear to be a double-edged sword to Twitter. Legitimate bots generate a large amount of benign tweets delivering news and updating feeds, while malicious bots spread spam or malicious contents. More interestingly, in the middle between human and bot, there has emerged cyborg referred to either bot-assisted human or human-assisted bot. To assist human users in identifying who they are interacting with, this paper focuses on the classification of human, bot and cyborg accounts on Twitter. We first conduct a set of large-scale measurements with a collection of over 500,000 accounts. We observe the difference among human, bot and cyborg in terms of tweeting behavior, tweet content, and account properties. Based on the measurement results, we propose a classification system that includes the following four parts: (1) an entropy-based component, (2) a machine-learning-based component, (3) an account properties component, and (4) a decision maker. It uses the combination of features extracted from an unknown user to determine the likelihood of being a human, bot or cyborg. Our experimental evaluation demonstrates the efficacy of the proposed classification system.","sourceIds":["conf/acsac/ChuGWJ10"]},{"url":"https://www.semanticscholar.org/paper/Streaming-First-Story-Detection-with-application-to-Petrovic-Osborne/8854ca5546396ef225112ec828094882a71fd01e?utm_campaign=DBLP+Prototype&utm_source=DBLP&utm_medium=Partner+API","title":"Streaming First Story Detection with application to Twitter","authors":[{"name":"Sasa Petrovic","url":"https://www.semanticscholar.org/author/Sasa-Petrovic/39243740"},{"name":"Miles Osborne","url":"https://www.semanticscholar.org/author/Miles-Osborne/2057788"},{"name":"Victor Lavrenko","url":"https://www.semanticscholar.org/author/Victor-Lavrenko/1757708"}],"venue":"HLT-NAACL","year":2010,"stats":{"influentialCitations":71,"estimatedTotalCitations":420.6472795361567,"velocity":47.0,"acceleration":-0.391304347826087},"journal":{"pages":"181-189"},"paperAbstract":"With the recent rise in popularity and size of social media, there is a growing need for systems that can extract useful information from this amount of data. We address the problem of detecting new events from a stream of Twitter posts. To make event detection feasible on web-scale corpora, we present an algorithm based on locality-sensitive hashing which is able overcome the limitations of traditional approaches, while maintaining competitive results. In particular, a comparison with a state-of-the-art system on the first story detection task shows that we achieve over an order of magnitude speedup in processing time, while retaining comparable performance. Event detection experiments on a collection of 160 million Twitter posts show that celebrity deaths are the fastest spreading news on Twitter.","sourceIds":["conf/naacl/PetrovicOL10"]},{"url":"https://www.semanticscholar.org/paper/Predicting-the-Political-Alignment-of-Twitter-Users-Conover-Gon%C3%A7alves/a115c5b0ce8ca5679324ed895e044d3215f74087?utm_campaign=DBLP+Prototype&utm_source=DBLP&utm_medium=Partner+API","title":"Predicting the Political Alignment of Twitter Users","authors":[{"name":"Michael D. Conover","url":"https://www.semanticscholar.org/author/Michael-D.-Conover/49479696"},{"name":"Bruno Gonçalves","url":"https://www.semanticscholar.org/author/Bruno-Gonçalves/145621244"},{"name":"Jacob Ratkiewicz","url":"https://www.semanticscholar.org/author/Jacob-Ratkiewicz/2951268"},{"name":"Alessandro Flammini","url":"https://www.semanticscholar.org/author/Alessandro-Flammini/1769960"},{"name":"Filippo Menczer","url":"https://www.semanticscholar.org/author/Filippo-Menczer/143653472"}],"venue":"2011 IEEE Third Int'l Conference on Privacy, Security, Risk and Trust and 2011 IEEE Third Int'l Conference on Social Computing","year":2011,"stats":{"influentialCitations":34,"estimatedTotalCitations":244.94472873418897,"velocity":43.666666666666664,"acceleration":-0.17073170731707318},"journal":{"name":"2011 IEEE Third Int'l Conference on Privacy, Security, Risk and Trust and 2011 IEEE Third Int'l Conference on Social Computing","pages":"192-199"},"paperAbstract":"The widespread adoption of social media for political communication creates unprecedented opportunities to monitor the opinions of large numbers of politically active individuals in real time. However, without a way to distinguish between users of opposing political alignments, conflicting signals at the individual level may, in the aggregate, obscure partisan differences in opinion that are important to political strategy. In this article we describe several methods for predicting the political alignment of Twitter users based on the content and structure of their political communication in the run-up to the 2010 U.S. midterm elections. Using a data set of 1,000 manually-annotated individuals, we find that a support vector machine (SVM) trained on hash tag metadata outperforms an SVM trained on the full text of users' tweets, yielding predictions of political affiliations with 91% accuracy. Applying latent semantic analysis to the content of users' tweets we identify hidden structure in the data strongly associated with political affiliation, but do not find that topic detection improves prediction performance. All of these content-based methods are outperformed by a classifier based on the segregated community structure of political information diffusion networks (95% accuracy). We conclude with a practical application of this machinery to web-based political advertising, and outline several approaches to public opinion monitoring based on the techniques developed herein.","sourceIds":["conf/socialcom/ConoverGRFM11"]},{"url":"https://www.semanticscholar.org/paper/Using-twitter-to-recommend-real-time-topical-news-Phelan-McCarthy/637694fe0520ee751da4d6ecc9ad2bf3a7dddfb9?utm_campaign=DBLP+Prototype&utm_source=DBLP&utm_medium=Partner+API","title":"Using twitter to recommend real-time topical news","authors":[{"name":"Owen Phelan","url":"https://www.semanticscholar.org/author/Owen-Phelan/3103817"},{"name":"Kevin McCarthy","url":"https://www.semanticscholar.org/author/Kevin-McCarthy/145511793"},{"name":"Barry Smyth","url":"https://www.semanticscholar.org/author/Barry-Smyth/144942414"}],"venue":"RecSys '09","year":2009,"stats":{"influentialCitations":15,"estimatedTotalCitations":266.6608082237099,"velocity":25.666666666666668,"acceleration":-0.27586206896551724},"journal":{"pages":"385-388"},"paperAbstract":"Recommending news stories to users, based on their preferences, has long been a favourite domain for recommender systems research. In this paper, we describe a novel approach to news recommendation that harnesses real-time micro-blogging activity, from a service such as Twitter, as the basis for promoting news stories from a user's favourite RSS feeds. A preliminary evaluation is carried out on an implementation of this technique that shows promising results.","sourceIds":["conf/recsys/PhelanMS09"]},{"url":"https://www.semanticscholar.org/paper/Semantic-Sentiment-Analysis-of-Twitter-Saif-He/01f3fdbc51a44f4c39c23580f766375851fa40b8?utm_campaign=DBLP+Prototype&utm_source=DBLP&utm_medium=Partner+API","title":"Semantic Sentiment Analysis of Twitter","authors":[{"name":"Hassan Saif","url":"https://www.semanticscholar.org/author/Hassan-Saif/2874824"},{"name":"Yulan He","url":"https://www.semanticscholar.org/author/Yulan-He/1704133"},{"name":"Harith Alani","url":"https://www.semanticscholar.org/author/Harith-Alani/145842687"}],"venue":"International Semantic Web Conference","year":2012,"stats":{"influentialCitations":19,"estimatedTotalCitations":223.01490976252282,"velocity":38.666666666666664,"acceleration":0.21875},"journal":{"pages":"508-524"},"paperAbstract":"Sentiment analysis over Twitter offer organisations a fast and effective way to monitor the publics' feelings towards their brand, business, directors, etc. A wide range of features and methods for training sentiment classifiers for Twitter datasets have been researched in recent years with varying results. In this paper, we introduce a novel approach of adding semantics as additional features into the training set for sentiment analysis. For each extracted entity (e.g. iPhone) from tweets, we add its semantic concept (e.g. \"Apple product\") as an additional feature, and measure the correlation of the representative concept with negative/positive sentiment. We apply this approach to predict sentiment for three different Twitter datasets. Our results show an average increase of F harmonic accuracy score for identifying both negative and positive sentiment of around 6.5% and 4.8% over the baselines of unigrams and part-of-speech features respectively. We also compare against an approach based on sentiment-bearing topic analysis, and find that semantic features produce better Recall and F score when classifying negative sentiment, and better Precision with lower Recall and F score in positive sentiment classification.","sourceIds":["conf/semweb/SaifHA12"]},{"url":"https://www.semanticscholar.org/paper/Towards-detecting-influenza-epidemics-by-analyzing-Culotta/ca4b6c4d3e1797c89ad9a338923f4845b423af3a?utm_campaign=DBLP+Prototype&utm_source=DBLP&utm_medium=Partner+API","title":"Towards detecting influenza epidemics by analyzing Twitter messages","authors":[{"name":"Aron Culotta","url":"https://www.semanticscholar.org/author/Aron-Culotta/1741453"}],"venue":"SOMA '10","year":2010,"stats":{"influentialCitations":40,"estimatedTotalCitations":336.56721026262653,"velocity":43.333333333333336,"acceleration":-0.4},"journal":{"pages":"115-122"},"paperAbstract":"Rapid response to a health epidemic is critical to reduce loss of life. Existing methods mostly rely on expensive surveys of hospitals across the country, typically with lag times of one to two weeks for influenza reporting, and even longer for less common diseases. In response, there have been several recently proposed solutions to estimate a population's health from Internet activity, most notably Google's Flu Trends service, which correlates search term frequency with influenza statistics reported by the Centers for Disease Control and Prevention (CDC). In this paper, we analyze messages posted on the micro-blogging site Twitter.com to determine if a similar correlation can be uncovered. We propose several methods to identify influenza-related messages and compare a number of regression models to correlate these messages with CDC statistics. Using over 500,000 messages spanning 10 weeks, we find that our best model achieves a correlation of .78 with CDC statistics by leveraging a document classifier to identify relevant messages.","sourceIds":["conf/kdd/Culotta10"]},{"url":"https://www.semanticscholar.org/paper/Detecting-controversial-events-from-twitter-Popescu-Pennacchiotti/353bb015f569f86a441bda5dd407d7d28de238af?utm_campaign=DBLP+Prototype&utm_source=DBLP&utm_medium=Partner+API","title":"Detecting controversial events from twitter","authors":[{"name":"Ana-Maria Popescu","url":"https://www.semanticscholar.org/author/Ana-Maria-Popescu/36445704"},{"name":"Marco Pennacchiotti","url":"https://www.semanticscholar.org/author/Marco-Pennacchiotti/145375801"}],"venue":"CIKM '10","year":2010,"stats":{"influentialCitations":11,"estimatedTotalCitations":125.6736240039454,"velocity":18.333333333333332,"acceleration":-0.4444444444444444},"journal":{"pages":"1873-1876"},"paperAbstract":"Social media provides researchers with continuously updated information about developments of interest to large audiences. This paper addresses the task of identifying controversial events using Twitter as a starting point: we propose 3 models for this task and report encouraging initial results.","sourceIds":["conf/cikm/PopescuP10"]},{"url":"https://www.semanticscholar.org/paper/Lexical-Normalisation-of-Short-Text-Messages:-Makn-Han-Baldwin/3de7ef76a010e624b47255b93bffa1a7c48e35a9?utm_campaign=DBLP+Prototype&utm_source=DBLP&utm_medium=Partner+API","title":"Lexical Normalisation of Short Text Messages: Makn Sens a #twitter","authors":[{"name":"Bo Han","url":"https://www.semanticscholar.org/author/Bo-Han/145720902"},{"name":"Timothy Baldwin","url":"https://www.semanticscholar.org/author/Timothy-Baldwin/145465286"}],"venue":"ACL","year":2011,"stats":{"influentialCitations":32,"estimatedTotalCitations":295.41471616882575,"velocity":32.333333333333336,"acceleration":-0.2413793103448276},"journal":{"pages":"368-378"},"paperAbstract":"Twitter provides access to large volumes of data in real time, but is notoriously noisy, hampering its utility for NLP. In this paper, we target out-of-vocabulary words in short text messages and propose a method for identifying and normalising ill-formed words. Our method uses a classifier to detect ill-formed words, and generates correction candidates based on morphophonemic similarity. Both word similarity and context are then exploited to select the most probable correction candidate for the word. The proposed method doesn't require any annotations, and achieves state-of-the-art performance over an SMS corpus and a novel dataset based on Twitter.","sourceIds":["conf/acl/HanB11"]},{"url":"https://www.semanticscholar.org/paper/A-Machine-Learning-Approach-to-Twitter-User-Pennacchiotti-Popescu/0148bbc80ea2f2526ab019a317639b4fb357f399?utm_campaign=DBLP+Prototype&utm_source=DBLP&utm_medium=Partner+API","title":"A Machine Learning Approach to Twitter User Classification","authors":[{"name":"Marco Pennacchiotti","url":"https://www.semanticscholar.org/author/Marco-Pennacchiotti/145375801"},{"name":"Ana-Maria Popescu","url":"https://www.semanticscholar.org/author/Ana-Maria-Popescu/36445704"}],"venue":"ICWSM","year":2011,"stats":{"influentialCitations":37,"estimatedTotalCitations":325.22389244152316,"velocity":50.0,"acceleration":-0.22641509433962265},"paperAbstract":"This paper addresses the task of user classification in social media, with an application to Twitter. We automatically infer the values of user attributes such as political orientation or ethnicity by leveraging observable information such as the user behavior, network structure and the linguistic content of the user’s Twitter feed. We employ a machine learning approach which relies on a comprehensive set of features derived from such user information. We report encouraging experimental results on 3 tasks with different characteristics: political affiliation detection, ethnicity identification and detecting affinity for a particular business. Finally, our analysis shows that rich linguistic features prove consistently valuable across the 3 tasks and show great promise for additional user classification needs.","sourceIds":["conf/icwsm/PennacchiottiP11"]},{"url":"https://www.semanticscholar.org/paper/Analyzing-user-modeling-on-twitter-for-personalized-Abel-Gao/f47a23e43d3e4adbd02b8a5f5048fc8dcf563d38?utm_campaign=DBLP+Prototype&utm_source=DBLP&utm_medium=Partner+API","title":"Analyzing user modeling on twitter for personalized news recommendations","authors":[{"name":"Fabian Abel","url":"https://www.semanticscholar.org/author/Fabian-Abel/1714362"},{"name":"Qi Gao","url":"https://www.semanticscholar.org/author/Qi-Gao/50617334"},{"name":"Geert-Jan Houben","url":"https://www.semanticscholar.org/author/Geert-Jan-Houben/143779489"},{"name":"Ke Tao","url":"https://www.semanticscholar.org/author/Ke-Tao/144360487"}],"venue":"UMAP'11","year":2011,"stats":{"influentialCitations":37,"estimatedTotalCitations":253.4374904411222,"velocity":26.0,"acceleration":0.0},"journal":{"pages":"1-12"},"paperAbstract":"How can micro-blogging activities on Twitter be leveraged for user modeling and personalization? In this paper we investigate this question and introduce a framework for user modeling on Twitter which enriches the semantics of Twitter messages (tweets) and identifies topics and entities (e.g. persons, events, products) mentioned in tweets. We analyze how strategies for constructing hashtag-based, entity-based or topic-based user profiles benefit from semantic enrichment and explore the temporal dynamics of those profiles. We further measure and compare the performance of the user modeling strategies in context of a personalized news recommendation system. Our results reveal how semantic enrichment enhances the variety and quality of the generated user profiles. Further, we see how the different user modeling strategies impact personalization and discover that the consideration of temporal profile patterns can improve recommendation quality.","sourceIds":["conf/um/AbelGHT11"]},{"url":"https://www.semanticscholar.org/paper/Twitter-Heron:-Stream-Processing-at-Scale-Kulkarni-Bhagat/e847c3ec130da57328db79a7fea794b07dbccdd9?utm_campaign=DBLP+Prototype&utm_source=DBLP&utm_medium=Partner+API","title":"Twitter Heron: Stream Processing at Scale","authors":[{"name":"Sanjeev Kulkarni","url":"https://www.semanticscholar.org/author/Sanjeev-Kulkarni/144699136"},{"name":"Nikunj Bhagat","url":"https://www.semanticscholar.org/author/Nikunj-Bhagat/28322549"},{"name":"Maosong Fu","url":"https://www.semanticscholar.org/author/Maosong-Fu/40434199"},{"name":"Vikas Kedigehalli","url":"https://www.semanticscholar.org/author/Vikas-Kedigehalli/3107582"},{"name":"Christopher Kellogg","url":"https://www.semanticscholar.org/author/Christopher-Kellogg/153448938"},{"name":"Sailesh Mittal","url":"https://www.semanticscholar.org/author/Sailesh-Mittal/2550987"},{"name":"Jignesh M. Patel","url":"https://www.semanticscholar.org/author/Jignesh-M.-Patel/49111633"},{"name":"Karthikeyan Ramasamy","url":"https://www.semanticscholar.org/author/Karthikeyan-Ramasamy/32976701"},{"name":"Siddarth Taneja","url":"https://www.semanticscholar.org/author/Siddarth-Taneja/39804157"}],"venue":"SIGMOD '15","year":2015,"stats":{"influentialCitations":58,"estimatedTotalCitations":275.5218890897958,"velocity":88.0,"acceleration":-0.27358490566037735},"journal":{"pages":"239-250"},"paperAbstract":"Storm has long served as the main platform for real-time analytics at Twitter. However, as the scale of data being processed in real-time at Twitter has increased, along with an increase in the diversity and the number of use cases, many limitations of Storm have become apparent. We need a system that scales better, has better debug-ability, has better performance, and is easier to manage -- all while working in a shared cluster infrastructure. We considered various alternatives to meet these needs, and in the end concluded that we needed to build a new real-time stream data processing system. This paper presents the design and implementation of this new system, called Heron. Heron is now the de facto stream data processing engine inside Twitter, and in this paper we also share our experiences from running Heron in production. In this paper, we also provide empirical evidence demonstrating the efficiency and scalability of Heron.","sourceIds":["conf/sigmod/KulkarniBFKKMPR15"]},{"url":"https://www.semanticscholar.org/paper/Open-domain-event-extraction-from-twitter-Ritter-Mausam/c5262730d8854f88106bdc204860ccf236b3345f?utm_campaign=DBLP+Prototype&utm_source=DBLP&utm_medium=Partner+API","title":"Open domain event extraction from twitter","authors":[{"name":"Alan Ritter","url":"https://www.semanticscholar.org/author/Alan-Ritter/1863425"},{"name":"Mausam","url":"https://www.semanticscholar.org/author/Mausam/2674444"},{"name":"Oren Etzioni","url":"https://www.semanticscholar.org/author/Oren-Etzioni/1741101"},{"name":"Sam Clark","url":"https://www.semanticscholar.org/author/Sam-Clark/46750413"}],"venue":"KDD","year":2012,"stats":{"influentialCitations":45,"estimatedTotalCitations":324.06333523454043,"velocity":53.0,"acceleration":0.2894736842105263},"journal":{"pages":"1104-1112"},"paperAbstract":"Tweets are the most up-to-date and inclusive stream of in- formation and commentary on current events, but they are also fragmented and noisy, motivating the need for systems that can extract, aggregate and categorize important events. Previous work on extracting structured representations of events has focused largely on newswire text; Twitter's unique characteristics present new challenges and opportunities for open-domain event extraction. This paper describes TwiCal-- the first open-domain event-extraction and categorization system for Twitter. We demonstrate that accurately extracting an open-domain calendar of significant events from Twitter is indeed feasible. In addition, we present a novel approach for discovering important event categories and classifying extracted events based on latent variable models. By leveraging large volumes of unlabeled data, our approach achieves a 14% increase in maximum F1 over a supervised baseline. A continuously updating demonstration of our system can be viewed at http://statuscalendar.com; Our NLP tools are available at http://github.com/aritter/ twitter_nlp.","sourceIds":["conf/kdd/RitterMEC12"]},{"url":"https://www.semanticscholar.org/paper/Flu-Detector-Tracking-Epidemics-on-Twitter-Lampos-Bie/15131cc4a4c5012fecaa5ac784a4d0d96a0b6d92?utm_campaign=DBLP+Prototype&utm_source=DBLP&utm_medium=Partner+API","title":"Flu Detector - Tracking Epidemics on Twitter","authors":[{"name":"Vasileios Lampos","url":"https://www.semanticscholar.org/author/Vasileios-Lampos/3006026"},{"name":"Tijl De Bie","url":"https://www.semanticscholar.org/author/Tijl-De-Bie/51204489"},{"name":"Nello Cristianini","url":"https://www.semanticscholar.org/author/Nello-Cristianini/1685083"}],"venue":"ECML/PKDD","year":2010,"stats":{"influentialCitations":5,"estimatedTotalCitations":154.73291477966447,"velocity":13.666666666666666},"journal":{"pages":"599-602"},"paperAbstract":"We present an automated tool with a web interface for tracking the prevalence of Influenza-like Illness (ILI) in several regions of the United Kingdom using the contents of Twitter's microblogging service. Our data is comprised by a daily average of approximately 200,000 geolocated tweets collected by targeting 49 urban centres in the UK for a time period of 40 weeks. Official ILI rates from the Health Protection Agency (HPA) form our ground truth. Bolasso, the bootstrapped version of LASSO, is applied in order to extract a consistent set of features, which are then used for learning a regression model.","sourceIds":["conf/pkdd/LamposBC10"]},{"url":"https://www.semanticscholar.org/paper/Massive-Social-Network-Analysis:-Mining-Twitter-for-Ediger-Jiang/4c99b87df6385bd945a00633f829e4a9ec5ce314?utm_campaign=DBLP+Prototype&utm_source=DBLP&utm_medium=Partner+API","title":"Massive Social Network Analysis: Mining Twitter for Social Good","authors":[{"name":"David Ediger","url":"https://www.semanticscholar.org/author/David-Ediger/2969299"},{"name":"Karl Jiang","url":"https://www.semanticscholar.org/author/Karl-Jiang/2825095"},{"name":"E. Jason Riedy","url":"https://www.semanticscholar.org/author/E.-Jason-Riedy/144417300"},{"name":"David A. Bader","url":"https://www.semanticscholar.org/author/David-A.-Bader/1713030"},{"name":"Courtney Corley","url":"https://www.semanticscholar.org/author/Courtney-Corley/1947728"},{"name":"Robert M. Farber","url":"https://www.semanticscholar.org/author/Robert-M.-Farber/2542113"},{"name":"William N. Reynolds","url":"https://www.semanticscholar.org/author/William-N.-Reynolds/34988160"}],"venue":"2010 39th International Conference on Parallel Processing","year":2010,"stats":{"influentialCitations":8,"estimatedTotalCitations":83.50988263338505,"velocity":11.333333333333334},"journal":{"name":"2010 39th International Conference on Parallel Processing","pages":"583-593"},"paperAbstract":"Social networks produce an enormous quantity of data. Facebook consists of over 400 million active users sharing over 5 billion pieces of information each month. Analyzing this vast quantity of unstructured data presents challenges for software and hardware. We present GraphCT, a Graph Characterization Toolkit for massive graphs representing social network data. On a 128-processor Cray XMT, GraphCT estimates the betweenness centrality of an artificially generated (R-MAT) 537 million vertex, 8.6 billion edge graph in 55 minutes and a real-world graph (Kwak, et al.) with 61.6 million vertices and 1.47 billion edges in 105 minutes. We use GraphCT to analyze public data from Twitter, a microblogging network. Twitter's message connections appear primarily tree-structured as a news dissemination system. Within the public data, however, are clusters of conversations. Using GraphCT, we can rank actors within these conversations and help analysts focus attention on a much smaller data subset.","sourceIds":["conf/icpp/EdigerJRBCFR10"]},{"url":"https://www.semanticscholar.org/paper/Breaking-News-Detection-and-Tracking-in-Twitter-Phuvipadawat-Murata/d4a4478e60466edfe5d3300f404eecec390e8ad1?utm_campaign=DBLP+Prototype&utm_source=DBLP&utm_medium=Partner+API","title":"Breaking News Detection and Tracking in Twitter","authors":[{"name":"Swit Phuvipadawat","url":"https://www.semanticscholar.org/author/Swit-Phuvipadawat/1765278"},{"name":"Tsuyoshi Murata","url":"https://www.semanticscholar.org/author/Tsuyoshi-Murata/1702484"}],"venue":"2010 IEEE/WIC/ACM International Conference on Web Intelligence and Intelligent Agent Technology","year":2010,"stats":{"influentialCitations":8,"estimatedTotalCitations":143.2511656029432,"velocity":24.0,"acceleration":0.11764705882352941},"journal":{"name":"2010 IEEE/WIC/ACM International Conference on Web Intelligence and Intelligent Agent Technology","volume":"3","pages":"120-123"},"paperAbstract":"Twitter has been used as one of the communication channels for spreading breaking news. We propose a method to collect, group, rank and track breaking news in Twitter. Since short length messages make similarity comparison difficult, we boost scores on proper nouns to improve the grouping results. Each group is ranked based on popularity and reliability factors. Current detection method is limited to facts part of messages. We developed an application called “Hotstream” based on the proposed method. Users can discover breaking news from the Twitter timeline. Each story is provided with the information of message originator, story development and activity chart. This provides a convenient way for people to follow breaking news and stay informed with real-time updates.","sourceIds":["conf/iat/PhuvipadawatM10"]},{"url":"https://www.semanticscholar.org/paper/A-framework-for-detecting-public-health-trends-with-Parker-Wei/a753c7826b6b2110679acc70c5be616c69c77e78?utm_campaign=DBLP+Prototype&utm_source=DBLP&utm_medium=Partner+API","title":"A framework for detecting public health trends with Twitter","authors":[{"name":"Jon Parker","url":"https://www.semanticscholar.org/author/Jon-Parker/123375251"},{"name":"Yifang Wei","url":"https://www.semanticscholar.org/author/Yifang-Wei/1777283"},{"name":"Andrew Yates","url":"https://www.semanticscholar.org/author/Andrew-Yates/144115896"},{"name":"Ophir Frieder","url":"https://www.semanticscholar.org/author/Ophir-Frieder/1741208"},{"name":"Nazli Goharian","url":"https://www.semanticscholar.org/author/Nazli-Goharian/1685063"}],"venue":"2013 IEEE/ACM International Conference on Advances in Social Networks Analysis and Mining (ASONAM 2013)","year":2013,"stats":{"estimatedTotalCitations":55.36557598646554,"velocity":7.333333333333333},"journal":{"name":"2013 IEEE/ACM International Conference on Advances in Social Networks Analysis and Mining (ASONAM 2013)","pages":"556-563"},"paperAbstract":"Traditional public health surveillance requires regular clinical reports and considerable effort by health professionals to analyze data. Therefore, a low cost alternative is of great practical use. As a platform used by over 500 million users worldwide to publish their ideas about many topics, including health conditions, Twitter provides researchers the freshest source of public health conditions on a global scale. We propose a framework for tracking public health condition trends via Twitter. The basic idea is to use frequent term sets from highly purified health-related tweets as queries into a Wikipedia article index - treating the retrieval of medically-related articles as an indicator of a health-related condition. By observing fluctuations in frequent term sets and in turn medically-related articles over a series of time slices of tweets, we detect shifts in public health conditions and concerns over time. Compared to existing approaches, our framework provides a general a priori identification of emerging public health conditions rather than a specific illness (e.g., influenza) as is commonly done.","sourceIds":["conf/asunam/ParkerWYFG13"]},{"url":"https://www.semanticscholar.org/paper/Twitter-sentiment-classification-for-measuring-Ji-Chun/b27d0eac3f6d6207ea39ac2aa7f4dca9b4fc32c1?utm_campaign=DBLP+Prototype&utm_source=DBLP&utm_medium=Partner+API","title":"Twitter sentiment classification for measuring public health concerns","authors":[{"name":"Xiang Ji","url":"https://www.semanticscholar.org/author/Xiang-Ji/145097639"},{"name":"Soon Ae Chun","url":"https://www.semanticscholar.org/author/Soon-Ae-Chun/1807047"},{"name":"Zhi Wei","url":"https://www.semanticscholar.org/author/Zhi-Wei/145312585"},{"name":"James Geller","url":"https://www.semanticscholar.org/author/James-Geller/144395353"}],"venue":"Social Network Analysis and Mining","year":2015,"stats":{"influentialCitations":5,"velocity":9.333333333333334},"journal":{"name":"Social Network Analysis and Mining","volume":"5"},"paperAbstract":"An important task of public health officials is to keep track of health issues, such as spreading epidemics. In this paper, we are addressing the issue of spreading public concernabout epidemics. Public concern about a communicable disease can be seen as a problem of its own. Keeping track of trends in concern about public health and identifying peaks of public concern are therefore crucial tasks. However, monitoring public health concerns is not only expensive with traditional surveillance systems, but also suffers from limited coverage and significant delays. To address these problems, we are using Twitter messages, which are available free of cost, are generated world-wide, and are posted in real time. We are measuring public concern using a two-step sentiment classification approach. In the first step, we distinguish Personal tweets from News (i.e., Non-Personal) tweets. In the second step, we further separate Personal Negative from Personal Non-Negative tweets. Both these steps consist themselves of two sub-steps. In the first sub-step (of both steps), our programs automatically generate training data using an emotion-oriented, clue-based method. In the second sub-step, we are training and testing three different Machine Learning (ML) models with the training data from the first sub-step; this allows us to determine the best ML model for different datasets. Furthermore, we are testing the already trained ML models with a human annotated, disjoint dataset. Based on the number of tweets classified as Personal Negative, we compute a Measure of Concern (MOC) and a timeline of the MOC. We attempt to correlate peaks of the MOC timeline to peaks of the News (Non-Personal) timeline. Our best accuracy results are achieved using the two-step method with a Naïve Bayes classifier for the Epidemic domain (six datasets) and the Mental Health domain (three datasets).","sourceIds":["journals/snam/JiCWG15"]},{"url":"https://www.semanticscholar.org/paper/Monitoring-Public-Health-Concerns-Using-Twitter-Ji-Chun/35b20781e6363226e18a5441278c98366572297d?utm_campaign=DBLP+Prototype&utm_source=DBLP&utm_medium=Partner+API","title":"Monitoring Public Health Concerns Using Twitter Sentiment Classifications","authors":[{"name":"Xiang Ji","url":"https://www.semanticscholar.org/author/Xiang-Ji/145097639"},{"name":"Soon Ae Chun","url":"https://www.semanticscholar.org/author/Soon-Ae-Chun/1807047"},{"name":"James Geller","url":"https://www.semanticscholar.org/author/James-Geller/144395353"}],"venue":"2013 IEEE International Conference on Healthcare Informatics","year":2013,"stats":{"influentialCitations":1,"velocity":8.666666666666666},"journal":{"name":"2013 IEEE International Conference on Healthcare Informatics","pages":"335-344"},"paperAbstract":"An important task of public health officials is to keep track of spreading epidemics, and the locations and speed with which they appear. Furthermore, there is interest in understanding how concerned the population is about a disease outbreak. Twitter can serve as an important data source to provide this information in real time. In this paper, we focus on sentiment classification of Twitter messages to measure the Degree of Concern (DOC) of the Twitter users. In order to achieve this goal, we develop a novel two-step sentiment classification workflow to automatically identify personal tweets and negative tweets. Based on this workflow, we present an Epidemic Sentiment Monitoring System (ESMOS) that provides tools for visualizing Twitter users' concern towards different diseases. The visual concern map and chart in ESMOS can help public health officials to identify the progression and peaks of concern for a disease in space and time, so that appropriate preventive actions can be taken. The DOC measure is based on the sentiment-based classifications. We compare clue-based and different Machine Learning methods to classify sentiments of Twitter users regarding diseases, first into personal and neutral tweets and then into negative from neutral personal tweets. In our experiments, Multinomial Naïve Bayes achieved overall the best results and took significantly less time to build the classifier than other methods.","sourceIds":["conf/ichi/JiCG13"]},{"url":"https://www.semanticscholar.org/paper/Discovering-geographical-topics-in-the-twitter-Hong-Ahmed/76c2f936e57f94bacf5a532745032fefa6bc59ee?utm_campaign=DBLP+Prototype&utm_source=DBLP&utm_medium=Partner+API","title":"Discovering geographical topics in the twitter stream","authors":[{"name":"Liangjie Hong","url":"https://www.semanticscholar.org/author/Liangjie-Hong/33888728"},{"name":"Amr Ahmed","url":"https://www.semanticscholar.org/author/Amr-Ahmed/143629707"},{"name":"Siva Gurumurthy","url":"https://www.semanticscholar.org/author/Siva-Gurumurthy/38051541"},{"name":"Alexander J. Smola","url":"https://www.semanticscholar.org/author/Alexander-J.-Smola/1691629"},{"name":"Kostas Tsioutsiouliklis","url":"https://www.semanticscholar.org/author/Kostas-Tsioutsiouliklis/1731462"}],"venue":"WWW","year":2012,"stats":{"influentialCitations":20,"estimatedTotalCitations":262.39304603747695,"velocity":34.666666666666664,"acceleration":0.0},"journal":{"pages":"769-778"},"paperAbstract":"Micro-blogging services have become indispensable communication tools for online users for disseminating breaking news, eyewitness accounts, individual expression, and protest groups. Recently, Twitter, along with other online social networking services such as Foursquare, Gowalla, Facebook and Yelp, have started supporting location services in their messages, either explicitly, by letting users choose their places, or implicitly, by enabling geo-tagging, which is to associate messages with latitudes and longitudes. This functionality allows researchers to address an exciting set of questions: 1) How is information created and shared across geographical locations, 2) How do spatial and linguistic characteristics of people vary across regions, and 3) How to model human mobility. Although many attempts have been made for tackling these problems, previous methods are either complicated to be implemented or oversimplified that cannot yield reasonable performance. It is a challenge task to discover topics and identify users' interests from these geo-tagged messages due to the sheer amount of data and diversity of language variations used on these location sharing services. In this paper we focus on Twitter and present an algorithm by modeling diversity in tweets based on topical diversity, geographical diversity, and an interest distribution of the user. Furthermore, we take the Markovian nature of a user's location into account. Our model exploits sparse factorial coding of the attributes, thus allowing us to deal with a large and diverse set of covariates efficiently. Our approach is vital for applications such as user profiling, content recommendation and topic tracking. We show high accuracy in location estimation based on our model. Moreover, the algorithm identifies interesting topics based on location and language.","sourceIds":["conf/www/HongAGST12"]},{"url":"https://www.semanticscholar.org/paper/Collaborative-filtering-with-temporal-dynamics-Koren/c1aa28159e768b75d0f4637a71d20da02efe1ef2?utm_campaign=DBLP+Prototype&utm_source=DBLP&utm_medium=Partner+API","title":"Collaborative filtering with temporal dynamics","authors":[{"name":"Yehuda Koren","url":"https://www.semanticscholar.org/author/Yehuda-Koren/1701121"}],"venue":"KDD","year":2009,"stats":{"influentialCitations":182,"estimatedTotalCitations":1021.400077713695,"velocity":126.66666666666667,"acceleration":-0.2846153846153846},"journal":{"pages":"447-456"},"paperAbstract":"Customer preferences for products are drifting over time. Product perception and popularity are constantly changing as new selection emerges. Similarly, customer inclinations are evolving, leading them to ever redefine their taste. Thus, modeling temporal dynamics should be a key when designing recommender systems or general customer preference models. However, this raises unique challenges. Within the eco-system intersecting multiple products and customers, many different characteristics are shifting simultaneously, while many of them influence each other and often those shifts are delicate and associated with a few data instances. This distinguishes the problem from concept drift explorations, where mostly a single concept is tracked. Classical time-window or instance-decay approaches cannot work, as they lose too much signal when discarding data instances. A more sensitive approach is required, which can make better distinctions between transient effects and long term patterns. The paradigm we offer is creating a model tracking the time changing behavior throughout the life span of the data. This allows us to exploit the relevant components of all data instances, while discarding only what is modeled as being irrelevant. Accordingly, we revamp two leading collaborative filtering recommendation approaches. Evaluation is made on a large movie rating dataset by Netflix. Results are encouraging and better than those previously reported on this dataset.","sourceIds":["conf/kdd/Koren09"]},{"url":"https://www.semanticscholar.org/paper/Collaborative-Filtering-Recommender-Systems-Schafer-Frankowski/c487236245a4ce3fd683a58eb14536977d62a958?utm_campaign=DBLP+Prototype&utm_source=DBLP&utm_medium=Partner+API","title":"Collaborative Filtering Recommender Systems","authors":[{"name":"J. Ben Schafer","url":"https://www.semanticscholar.org/author/J.-Ben-Schafer/8874758"},{"name":"Dan Frankowski","url":"https://www.semanticscholar.org/author/Dan-Frankowski/2194947"},{"name":"Jonathan L. Herlocker","url":"https://www.semanticscholar.org/author/Jonathan-L.-Herlocker/2658798"},{"name":"Shilad Sen","url":"https://www.semanticscholar.org/author/Shilad-Sen/3342684"}],"venue":"The Adaptive Web","year":2007,"stats":{"influentialCitations":78,"estimatedTotalCitations":775.0597727500253,"velocity":92.66666666666667,"acceleration":-0.32323232323232326},"journal":{"pages":"291-324"},"paperAbstract":"One of the potent personalization technologies powering the adaptive web is collaborative filtering. Collaborative filtering (CF) is the process of filtering or evaluating items through the opinions of other people. CF technology brings together the opinions of large interconnected communities on the web, supporting filtering of substantial quantities of data. In this chapter we introduce the core concepts of collaborative filtering, its primary uses for users of the adaptive web, the theory and practice of CF algorithms, and design decisions regarding rating systems and acquisition of ratings. We also discuss how to evaluate CF systems, and the evolution of rich interaction interfaces. We close the chapter with discussions of the challenges of privacy particular to a CF recommendation service and important open research questions in the field.","sourceIds":["conf/adaptive/SchaferFHS07"]},{"url":"https://www.semanticscholar.org/paper/An-analysis-of-Twitter-messages-in-the-2011-Tohoku-Doan-Vo/0a5fc63c9b951cdb3155d6edcf46ad031f7a76f2?utm_campaign=DBLP+Prototype&utm_source=DBLP&utm_medium=Partner+API","title":"An analysis of Twitter messages in the 2011 Tohoku Earthquake","authors":[{"name":"Son Doan","url":"https://www.semanticscholar.org/author/Son-Doan/145744305"},{"name":"Bao-Khanh Ho Vo","url":"https://www.semanticscholar.org/author/Bao-Khanh-Ho-Vo/1849521"},{"name":"Nigel Collier","url":"https://www.semanticscholar.org/author/Nigel-Collier/3072167"}],"venue":"eHealth","year":2011,"stats":{"influentialCitations":5,"estimatedTotalCitations":58.34573445886082,"velocity":9.0},"journal":{"pages":"58-66"},"paperAbstract":"Social media such as Facebook and Twitter have proven to be a useful resource to understand public opinion towards real world events. In this paper, we investigate over 1.5 million Twitter messages (tweets) for the period 9th March 2011 to 31st May 2011 in order to track awareness and anxiety levels in the Tokyo metropolitan district to the 2011 Tohoku Earthquake and subsequent tsunami and nuclear emergencies. These three events were tracked using both English and Japanese tweets. Preliminary results indicated: 1) close correspondence between Twitter data and earthquake events, 2) strong correlation between English and Japanese tweets on the same events, 3) tweets in the native language play an important roles in early warning, 4) tweets showed how quickly Japanese people’s anxiety returned to normal levels after the earthquake event. Several distinctions between English and Japanese tweets on earthquake events are also discussed. The results suggest that Twitter data can be used as a useful resource for tracking the public mood of populations affected by natural disasters as well as an early warning system.","sourceIds":["conf/ehealth/DoanVC11","journals/corr/abs-1109-1618"]},{"url":"https://www.semanticscholar.org/paper/Using-social-media-to-monitor-mental-health-%E2%88%92-from-McClellan-Ali/00ac4963560d797c4a690ad8ed2855f0e16b5ded?utm_campaign=DBLP+Prototype&utm_source=DBLP&utm_medium=Partner+API","title":"Using social media to monitor mental health discussions − evidence from Twitter","authors":[{"name":"Chandler McClellan","url":"https://www.semanticscholar.org/author/Chandler-McClellan/38005917"},{"name":"Mir M. Ali","url":"https://www.semanticscholar.org/author/Mir-M.-Ali/145701414"},{"name":"Ryan Mutter","url":"https://www.semanticscholar.org/author/Ryan-Mutter/2157823"},{"name":"Larry Kroutil","url":"https://www.semanticscholar.org/author/Larry-Kroutil/6176410"},{"name":"Justin Landwehr","url":"https://www.semanticscholar.org/author/Justin-Landwehr/5039883"}],"venue":"JAMIA","year":2016,"stats":{"velocity":8.0},"journal":{"name":"Journal of the American Medical Informatics Association","volume":"24","pages":"496–502"},"paperAbstract":"Objectives\nGiven the public health importance of communicating about mental illness and the growing use of social media to convey information, our goal was to develop an empirical model to identify periods of heightened interest in mental health topics on Twitter.\n\n\nMaterials and Methods\nWe collected data on 176 million tweets from 2011 to 2014 with content related to depression or suicide. Using an autoregressive integrated moving average (ARIMA) data analysis, we identified deviations from predicted trends in communication about depression and suicide.\n\n\nResults\nTwo types of heightened Twitter activity regarding depression or suicide were identified in 2014: expected increases in response to planned behavioral health events, and unexpected increases in response to unanticipated events. Tweet volume following expected increases went back to the predicted level more rapidly than the volume following unexpected events.\n\n\nDiscussion\nAlthough ARIMA models have been used extensively in other fields, they have not been used widely in public health. Our findings indicate that our ARIMA model is valid for identifying periods of heightened activity on Twitter related to behavioral health. The model offers an objective and empirically based measure to identify periods of greater interest for timing the dissemination of credible information related to mental health.\n\n\nConclusion\nSpikes in tweet volume following a behavioral health event often last for less than 2 days. Individuals and organizations that want to disseminate behavioral health messages on Twitter in response to heightened periods of interest need to take this limited time frame into account.","sourceIds":["journals/jamia/McClellanAMKL17"]},{"url":"https://www.semanticscholar.org/paper/Bayesian-Filtering-for-Location-Estimation-Fox-Hightower/1be896a05ef7558df23d1ef5de4b9ab8f3aad283?utm_campaign=DBLP+Prototype&utm_source=DBLP&utm_medium=Partner+API","title":"Bayesian Filtering for Location Estimation","authors":[{"name":"Dieter Fox","url":"https://www.semanticscholar.org/author/Dieter-Fox/145197953"},{"name":"Jeffrey Hightower","url":"https://www.semanticscholar.org/author/Jeffrey-Hightower/145695326"},{"name":"Lin Liao","url":"https://www.semanticscholar.org/author/Lin-Liao/145655814"},{"name":"Dirk Schulz","url":"https://www.semanticscholar.org/author/Dirk-Schulz/144590149"},{"name":"Gaetano Borriello","url":"https://www.semanticscholar.org/author/Gaetano-Borriello/1735801"}],"venue":"IEEE Pervasive Comput.","year":2003,"stats":{"influentialCitations":32,"estimatedTotalCitations":400.6732427597432,"velocity":19.0,"acceleration":-0.1},"journal":{"name":"IEEE Pervasive Comput.","volume":"2","pages":"24-33"},"paperAbstract":"Bayesian-filter techniques provide a powerful statistical tool to help manage measurement uncertainty and perform multisensor fusion and identity estimation. The authors survey Bayes filter implementations and show their application to real-world location-estimation tasks common in pervasive computing.","sourceIds":["journals/pervasive/FoxHLSB03"]},{"url":"https://www.semanticscholar.org/paper/Selecting-Quality-Twitter-Content-for-Events-Becker-Naaman/24dab89bcd046a9cbe4a7a2e8eb9e9478d9a7c56?utm_campaign=DBLP+Prototype&utm_source=DBLP&utm_medium=Partner+API","title":"Selecting Quality Twitter Content for Events","authors":[{"name":"Hila Becker","url":"https://www.semanticscholar.org/author/Hila-Becker/47503402"},{"name":"Mor Naaman","url":"https://www.semanticscholar.org/author/Mor-Naaman/1687465"},{"name":"Luis Gravano","url":"https://www.semanticscholar.org/author/Luis-Gravano/1684012"}],"venue":"ICWSM","year":2011,"stats":{"influentialCitations":8,"estimatedTotalCitations":56.61717925680737,"velocity":7.666666666666667},"paperAbstract":"Social media sites such as Twitter contain large amounts of user contributed messages for a wide variety of real-world events. While some of these \"event messages\" might contain interesting and useful information (e.g., event time, location, participants, opinions), others might provide little value (e.g., using heavy slang, incomprehensible language) to people interested in learning about an event. Techniques for effective selection of quality event content may therefore help improve applications such as event browsing and search.In this paper, we explore approaches for finding representative messages among a set of Twitter messages that correspond to the same event, with the goal of identifying high quality, relevant messages that provide useful event information. We evaluate our approaches using a large-scale dataset of Twitter messages, and show that we can automatically select event messages that are both relevant and useful.","sourceIds":["conf/icwsm/BeckerNG11a"]},{"url":"https://www.semanticscholar.org/paper/Emergency-Management,-Twitter,-and-Social-Media-Latonero-Shklovski/f11b191ccee27c7d7a07af26770b27ebd7cba6c9?utm_campaign=DBLP+Prototype&utm_source=DBLP&utm_medium=Partner+API","title":"Emergency Management, Twitter, and Social Media Evangelism","authors":[{"name":"Mark Latonero","url":"https://www.semanticscholar.org/author/Mark-Latonero/2662572"},{"name":"Irina Shklovski","url":"https://www.semanticscholar.org/author/Irina-Shklovski/2692274"}],"venue":"IJISCRAM","year":2011,"stats":{"influentialCitations":11,"estimatedTotalCitations":74.72714826983821,"velocity":12.666666666666666},"journal":{"name":"IJISCRAM","volume":"3","pages":"1-16"},"paperAbstract":"This paper considers how emergency response organizations utilize available social media technologies to communicate with the public in emergencies and to potentially collect valuable information using the public as sources of information on the ground. The authors discuss the use of public social media tools from the emergency management professional’s viewpoint with a particular focus on the use of Twitter. Limited research has investigated Twitter usage in crisis situations from an organizational perspective. This paper contributes to the understanding of organizational innovation, risk communication, and technology adoption by emergency management. An in-depth longitudinal case study of Public Information Officers (PIO) of the Los Angeles Fire Department highlights the importance of the information evangelist within emergency management organizations and details the challenges those organizations face engaging with social media and Twitter. This article provides insights into practices and challenges of new media implementation for crisis and risk management organizations.","sourceIds":["journals/ijiscram/LatoneroS11"]},{"url":"https://www.semanticscholar.org/paper/A-Survey-of-Techniques-for-Event-Detection-in-Farzindar-Khreich/b0a8d512169453d92fbe44bc77a96bcc9cb9c85f?utm_campaign=DBLP+Prototype&utm_source=DBLP&utm_medium=Partner+API","title":"A Survey of Techniques for Event Detection in Twitter","authors":[{"name":"Atefeh Farzindar","url":"https://www.semanticscholar.org/author/Atefeh-Farzindar/2439756"},{"name":"Wael Khreich","url":"https://www.semanticscholar.org/author/Wael-Khreich/1754731"}],"venue":"Comput. Intell.","year":2015,"stats":{"influentialCitations":39,"estimatedTotalCitations":690.680120700351,"velocity":84.33333333333333,"acceleration":0.0547945205479452},"journal":{"name":"Comput. Intell.","volume":"31","pages":"132-164"},"paperAbstract":"Twitter is among the fastest-growing microblogging and online social networking services. Messages posted on Twitter tweets have been reporting everything from daily life stories to the latest local and global news and events. Monitoring and analyzing this rich and continuous user-generated content can yield unprecedentedly valuable information, enabling users and organizations to acquire actionable knowledge. This article provides a survey of techniques for event detection from Twitter streams. These techniques aim at finding real-world occurrences that unfold over space and time. In contrast to conventional media, event detection from Twitter streams poses new challenges. Twitter streams contain large amounts of meaningless messages and polluted content, which negatively affect the detection performance. In addition, traditional text mining techniques are not suitable, because of the short length of tweets, the large number of spelling and grammatical errors, and the frequent use of informal and mixed language. Event detection techniques presented in literature address these issues by adapting techniques from various fields to the uniqueness of Twitter. This article classifies these techniques according to the event type, detection task, and detection method and discusses commonly used features. Finally, it highlights the need for public benchmarks to evaluate the performance of different detection approaches and various features.","sourceIds":["journals/ci/FarzindarK15"]},{"url":"https://www.semanticscholar.org/paper/Geo-located-Twitter-as-proxy-for-global-mobility-Hawelka-Sitko/1ce131eb33e6126644477ec75303403d5b8ad637?utm_campaign=DBLP+Prototype&utm_source=DBLP&utm_medium=Partner+API","title":"Geo-located Twitter as proxy for global mobility patterns","authors":[{"name":"Bartosz Hawelka","url":"https://www.semanticscholar.org/author/Bartosz-Hawelka/1802059"},{"name":"Izabela Sitko","url":"https://www.semanticscholar.org/author/Izabela-Sitko/1766257"},{"name":"Euro Beinat","url":"https://www.semanticscholar.org/author/Euro-Beinat/1787743"},{"name":"Stanislav Sobolevsky","url":"https://www.semanticscholar.org/author/Stanislav-Sobolevsky/2873070"},{"name":"Pavlos Kazakopoulos","url":"https://www.semanticscholar.org/author/Pavlos-Kazakopoulos/1790287"},{"name":"Carlo Ratti","url":"https://www.semanticscholar.org/author/Carlo-Ratti/145320204"}],"venue":"Cartography and geographic information science","year":2014,"stats":{"influentialCitations":16,"estimatedTotalCitations":209.91404371153124,"velocity":52.666666666666664,"acceleration":-0.19642857142857142},"journal":{"name":"","volume":"41","pages":"260 - 271"},"paperAbstract":"Pervasive presence of location-sharing services made it possible for researchers to gain an unprecedented access to the direct records of human activity in space and time. This article analyses geo-located Twitter messages in order to uncover global patterns of human mobility. Based on a dataset of almost a billion tweets recorded in 2012, we estimate the volume of international travelers by country of residence. Mobility profiles of different nations were examined based on such characteristics as mobility rate, radius of gyration, diversity of destinations, and inflow-outflow balance. Temporal patterns disclose the universally valid seasons of increased international mobility and the particular character of international travels of different nations. Our analysis of the community structure of the Twitter mobility network reveals spatially cohesive regions that follow the regional division of the world. We validate our result using global tourism statistics and mobility models provided by other authors and argue that Twitter is exceptionally useful for understanding and quantifying global mobility patterns.","sourceIds":["journals/corr/HawelkaSBSKR13"]},{"url":"https://www.semanticscholar.org/paper/Muliscale-Vessel-Enhancement-Filtering-Frangi-Niessen/454ad65e94b885c3f577576c910821cece5e2179?utm_campaign=DBLP+Prototype&utm_source=DBLP&utm_medium=Partner+API","title":"Muliscale Vessel Enhancement Filtering","authors":[{"name":"Alejandro F. Frangi","url":"https://www.semanticscholar.org/author/Alejandro-F.-Frangi/1681129"},{"name":"Wiro J. Niessen","url":"https://www.semanticscholar.org/author/Wiro-J.-Niessen/1748469"},{"name":"Koen L. Vincken","url":"https://www.semanticscholar.org/author/Koen-L.-Vincken/1682123"},{"name":"Max A. Viergever","url":"https://www.semanticscholar.org/author/Max-A.-Viergever/1704117"}],"venue":"MICCAI","year":1998,"stats":{"influentialCitations":327,"estimatedTotalCitations":2299.2105410068825,"velocity":227.66666666666666,"acceleration":-0.27983539094650206},"journal":{"pages":"130-137"},"paperAbstract":"The multiscale second order local structure of an image (Hessian) is examined with the purpose of developing a vessel enhancement filter. A vesselness measure is obtained on the basis of all eigenvalues of the Hessian. This measure is tested on two dimensional DSA and three dimensional aortoiliac and cerebral MRA data. Its clinical utility is shown by the simultaneous noise and background suppression and vessel enhancement in maximum intensity projections and volumetric displays.","sourceIds":["conf/miccai/FrangiNVV98"]},{"url":"https://www.semanticscholar.org/paper/Towards-Automatically-Classifying-Depressive-from-Mowery-Park/54c70144bff60ba3f110c8ae187d78022b6bdc07?utm_campaign=DBLP+Prototype&utm_source=DBLP&utm_medium=Partner+API","title":"Towards Automatically Classifying Depressive Symptoms from Twitter Data for Population Health","authors":[{"name":"Danielle L. Mowery","url":"https://www.semanticscholar.org/author/Danielle-L.-Mowery/8248537"},{"name":"Albert Park","url":"https://www.semanticscholar.org/author/Albert-Park/1913133"},{"name":"Craig J Bryan","url":"https://www.semanticscholar.org/author/Craig-J-Bryan/3457018"},{"name":"Mike Conway","url":"https://www.semanticscholar.org/author/Mike-Conway/144494734"}],"venue":"PEOPLES@COLING","year":2016,"stats":{"influentialCitations":2,"velocity":7.0},"journal":{"pages":"182-191"},"paperAbstract":"Major depressive disorder, a debilitating and burdensome disease experienced by individuals worldwide, can be defined by several depressive symptoms (e.g., anhedonia (inability to feel pleasure), depressed mood, difficulty concentrating, etc.). Individuals often discuss their experiences with depression symptoms on public social media platforms like Twitter, providing a potentially useful data source for monitoring population-level mental health risk factors. In a step towards developing an automated method to estimate the prevalence of symptoms associated with major depressive disorder over time in the United States using Twitter, we developed classifiers for discerning whether a Twitter tweet represents no evidence of depression or evidence of depression. If there was evidence of depression, we then classified whether the tweet contained a depressive symptom and if so, which of three subtypes: depressed mood, disturbed sleep, or fatigue or loss of energy. We observed that the most accurate classifiers could predict classes with high-to-moderate F1-score performances for no evidence of depression (85), evidence of depression (52), and depressive symptoms (49). We report moderate F1-scores for depressive symptoms ranging from 75 (fatigue or loss of energy) to 43 (disturbed sleep) to 35 (depressed mood). Our work demonstrates baseline approaches for automatically encoding Twitter data with granular depressive symptoms associated with major depressive disorder.","sourceIds":["conf/coling/MoweryPBC16"]},{"url":"https://www.semanticscholar.org/paper/Characterizing-Diabetes,-Diet,-Exercise,-and-on-Karami-Dahl/037acf0485f1ed2e8bd8a6b9d6edb4e56a1f08a4?utm_campaign=DBLP+Prototype&utm_source=DBLP&utm_medium=Partner+API","title":"Characterizing Diabetes, Diet, Exercise, and Obesity Comments on Twitter","authors":[{"name":"Amir Karami","url":"https://www.semanticscholar.org/author/Amir-Karami/145428860"},{"name":"Alicia A. Dahl","url":"https://www.semanticscholar.org/author/Alicia-A.-Dahl/27145584"},{"name":"Gabrielle M. Turner-McGrievy","url":"https://www.semanticscholar.org/author/Gabrielle-M.-Turner-McGrievy/1398534319"},{"name":"Hadi Kharrazi","url":"https://www.semanticscholar.org/author/Hadi-Kharrazi/144780504"},{"name":"George Shaw","url":"https://www.semanticscholar.org/author/George-Shaw/3136243"}],"venue":"Int. J. Inf. Manag.","year":2017,"stats":{"influentialCitations":1,"velocity":10.333333333333334,"acceleration":0.5},"journal":{"name":"Int. J. Inf. Manag.","volume":"38","pages":"1-6"},"paperAbstract":"Social media provide a platform for users to express their opinions and share information. Understanding public health opinions on social media, such as Twitter, offers a unique approach to characterizing common health issues such as diabetes, diet, exercise, and obesity (DDEO), however, collecting and analyzing a large scale conversational public health data set is a challenging research task. The goal of this research is to analyze the characteristics of the general public's opinions in regard to diabetes, diet, exercise and obesity (DDEO) as expressed on Twitter. A multi-component semantic and linguistic framework was developed to collect Twitter data, discover topics of interest about DDEO, and analyze the topics. From the extracted 4.5 million tweets, 8% of tweets discussed diabetes, 23.7% diet, 16.6% exercise, and 51.7% obesity. The strongest correlation among the topics was determined between exercise and obesity. Other notable correlations were: diabetes and obesity, and diet and obesity DDEO terms were also identified as subtopics of each of the DDEO topics. The frequent subtopics discussed along with Diabetes, excluding the DDEO terms themselves, were blood pressure, heart attack, yoga, and Alzheimer. The non-DDEO subtopics for Diet included vegetarian, pregnancy, celebrities, weight loss, religious, and mental health, while subtopics for Exercise included computer games, brain, fitness, and daily plan. Non-DDEO subtopics for Obesity included Alzheimer, cancer, and children. With 2.67 billion social media users in 2016, publicly available data such as Twitter posts can be utilized to support clinical providers, public health experts, and social scientists in better understanding common public opinions in regard to diabetes, diet, exercise, and obesity.","sourceIds":["journals/ijinfoman/KaramiDTKS18","journals/corr/abs-1709-07916"]},{"url":"https://www.semanticscholar.org/paper/Twitter-Trending-Topic-Classification-Lee-Palsetia/a5c01f2a114c91d0f8c0434cdb683ffdcfa463f4?utm_campaign=DBLP+Prototype&utm_source=DBLP&utm_medium=Partner+API","title":"Twitter Trending Topic Classification","authors":[{"name":"Kathy Lee","url":"https://www.semanticscholar.org/author/Kathy-Lee/1694037"},{"name":"Diana Palsetia","url":"https://www.semanticscholar.org/author/Diana-Palsetia/3019232"},{"name":"Ramanathan Narayanan","url":"https://www.semanticscholar.org/author/Ramanathan-Narayanan/37283750"},{"name":"Md. Mostofa Ali Patwary","url":"https://www.semanticscholar.org/author/Md.-Mostofa-Ali-Patwary/8176660"},{"name":"Ankit Agrawal","url":"https://www.semanticscholar.org/author/Ankit-Agrawal/144186018"},{"name":"Alok N. Choudhary","url":"https://www.semanticscholar.org/author/Alok-N.-Choudhary/143975793"}],"venue":"2011 IEEE 11th International Conference on Data Mining Workshops","year":2011,"stats":{"influentialCitations":16,"estimatedTotalCitations":120.93088340232552,"velocity":23.333333333333332,"acceleration":0.21052631578947367},"journal":{"name":"2011 IEEE 11th International Conference on Data Mining Workshops","pages":"251-258"},"paperAbstract":"With the increasing popularity of microblogging sites, we are in the era of information explosion. As of June 2011, about 200 million tweets are being generated everyday. Although Twitter provides a list of most popular topics people tweet about known as Trending Topics in real time, it is often hard to understand what these trending topics are about. Therefore, it is important and necessary to classify these topics into general categories with high accuracy for better information retrieval. To address this problem, we classify Twitter Trending Topics into 18 general categories such as sports, politics, technology, etc. We experiment with 2 approaches for topic classification, (i) the well-known Bag-of-Words approach for text classification and (ii) network-based classification. In text-based classification method, we construct word vectors with trending topic definition and tweets, and the commonly used tf-idf weights are used to classify the topics using a Naive Bayes Multinomial classifier. In network-based classification method, we identify top 5 similar topics for a given topic based on the number of common influential users. The categories of the similar topics and the number of common influential users between the given topic and its similar topics are used to classify the given topic using a C5.0 decision tree learner. Experiments on a database of randomly selected 768 trending topics (over 18 classes) show that classification accuracy of up to 65% and 70% can be achieved using text-based and network-based classification modeling respectively.","sourceIds":["conf/icdm/LeePNPAC11"]},{"url":"https://www.semanticscholar.org/paper/Twitter-for-crisis-communication:-lessons-learned-Acar-Muraki/ffd67538a3701a51046cb9f458de2029b4a9eefa?utm_campaign=DBLP+Prototype&utm_source=DBLP&utm_medium=Partner+API","title":"Twitter for crisis communication: lessons learned from Japan's tsunami disaster","authors":[{"name":"Adam Acar","url":"https://www.semanticscholar.org/author/Adam-Acar/40394363"},{"name":"Yuya Muraki","url":"https://www.semanticscholar.org/author/Yuya-Muraki/27360522"}],"venue":"IJWBC","year":2011,"stats":{"influentialCitations":26,"estimatedTotalCitations":134.9103507364721,"velocity":24.333333333333332,"acceleration":-0.047619047619047616},"journal":{"name":"IJWBC","volume":"7","pages":"392-402"},"paperAbstract":"Two weeks after the Great Tohoku earthquake followed by the devastating tsunami, we have sent open-ended questionnaires to a randomly selected sample of Twitter users and also analysed the tweets sent from the disaster-hit areas. We found that people in directly affected areas tend to tweet about their unsafe and uncertain situation while people in remote areas post messages to let their followers know that they are safe. Our analysis of the open-ended answers has revealed that unreliable retweets (RTs) on Twitter was the biggest problem the users have faced during the disaster. Some of the solutions offered by the respondents included introducing official hash tags, limiting the number of RTs for each hash tag and adding features that allow users to trace information by maintaining anonymity.","sourceIds":["journals/ijwbc/AcarM11"]},{"url":"https://www.semanticscholar.org/paper/Hip-and-trendy:-Characterizing-emerging-trends-on-Naaman-Becker/aedca557e79d36d4c3f81f76a247a98f1cfffcc4?utm_campaign=DBLP+Prototype&utm_source=DBLP&utm_medium=Partner+API","title":"Hip and trendy: Characterizing emerging trends on Twitter","authors":[{"name":"Mor Naaman","url":"https://www.semanticscholar.org/author/Mor-Naaman/1687465"},{"name":"Hila Becker","url":"https://www.semanticscholar.org/author/Hila-Becker/47503402"},{"name":"Luis Gravano","url":"https://www.semanticscholar.org/author/Luis-Gravano/1684012"}],"venue":"J. Assoc. Inf. Sci. Technol.","year":2011,"stats":{"influentialCitations":11,"estimatedTotalCitations":129.75323317985098,"velocity":14.0},"journal":{"name":"J. Assoc. Inf. Sci. Technol.","volume":"62","pages":"902-918"},"paperAbstract":"Twitter, Facebook, and other related systems that we call social awareness streams are rapidly changing the information and communication dynamics of our society. These systems, where hundreds of millions of users share short messages in real time, expose the aggregate interests and attention of global and local communities. In particular, emerging temporal trends in these systems, especially those related to a single geographic area, are a significant and revealing source of information for, and about, a local community. This study makes two essential contributions for interpreting emerging temporal trends in these information systems. First, based on a large dataset of Twitter messages from one geographic area, we develop a taxonomy of the trends present in the data. Second, we identify important dimensions according to which trends can be categorized, as well as the key distinguishing features of trends that can be derived from their associated messages. We quantitatively examine the computed features for different categories of trends, and establish that significant differences can be detected across categories. Our study advances the understanding of trends on Twitter and other social awareness streams, which will enable powerful applications and activities, including user-driven real-time information services for local communities. © 2011 Wiley Periodicals, Inc.","sourceIds":["journals/jasis/NaamanBG11"]},{"url":"https://www.semanticscholar.org/paper/Predicting-the-Demographics-of-Twitter-Users-from-Culotta-Kumar/b8f8980efb2684ba2a0b7ddf8ea88a9fe09f2ade?utm_campaign=DBLP+Prototype&utm_source=DBLP&utm_medium=Partner+API","title":"Predicting the Demographics of Twitter Users from Website Traffic Data","authors":[{"name":"Aron Culotta","url":"https://www.semanticscholar.org/author/Aron-Culotta/1741453"},{"name":"Nirmal Ravi Kumar","url":"https://www.semanticscholar.org/author/Nirmal-Ravi-Kumar/145377664"},{"name":"Jennifer Cutler","url":"https://www.semanticscholar.org/author/Jennifer-Cutler/145962844"}],"venue":"AAAI","year":2015,"stats":{"influentialCitations":9,"estimatedTotalCitations":73.84230843233756,"velocity":17.666666666666668,"acceleration":-0.375},"journal":{"pages":"72-78"},"paperAbstract":"Understanding the demographics of users of online social networks has important applications for health, marketing, and public messaging. In this paper, we predict the demographics of Twitter users based on whom they follow. Whereas most prior approaches rely on a supervised learning approach, in which individual users are labeled with demographics, we instead create a distantly labeled dataset by collecting audience measurement data for 1,500 websites (e.g., 50% of visitors to gizmodo.com are estimated to have a bachelor's degree). We then fit a regression model to predict these demographics using information about the followers of each website on Twitter. The resulting average held-out correlation is .77 across six different variables (gender, age, ethnicity, education, income, and child status). We additionally validate the model on a smaller set of Twitter users labeled individually for ethnicity and gender, finding performance that is surprisingly competitive with a fully supervised approach.","sourceIds":["conf/aaai/CulottaKC15"]},{"url":"https://www.semanticscholar.org/paper/Discovering-Consumer-Insight-from-Twitter-via-Chamlertwat-Bhattarakosol/b32c462e6a5821c62c852bb42a8730eff880f8cd?utm_campaign=DBLP+Prototype&utm_source=DBLP&utm_medium=Partner+API","title":"Discovering Consumer Insight from Twitter via Sentiment Analysis","authors":[{"name":"Wilas Chamlertwat","url":"https://www.semanticscholar.org/author/Wilas-Chamlertwat/3317609"},{"name":"Pattarasinee Bhattarakosol","url":"https://www.semanticscholar.org/author/Pattarasinee-Bhattarakosol/2524840"},{"name":"Tippakorn Rungkasiri","url":"https://www.semanticscholar.org/author/Tippakorn-Rungkasiri/2716654"},{"name":"Choochart Haruechaiyasak","url":"https://www.semanticscholar.org/author/Choochart-Haruechaiyasak/2815356"}],"venue":"J. UCS","year":2012,"stats":{"influentialCitations":5,"estimatedTotalCitations":67.66387856838067,"velocity":10.666666666666666,"acceleration":0.0},"journal":{"name":"J. UCS","volume":"18","pages":"973-992"},"paperAbstract":"Traditional approaches for studying consumer behavior, such as marketing survey and focus group, require a large amount of time and resources. Moreover, some products, such as smartphones, have a short product life cycle. As an alternative solution, we propose a system, the Micro-blog Sentiment Analysis System (MSAS), based on sentiment analysis to automatically analyze customer opinions from the Twitter micro-blog service. The MSAS consists of five main functions to (1) collect Twitter posts, (2) filter for opinionated posts, (3) detect polarity in each post, (4) categorize product features and (5) summarize and visualize the overall results. We used the product domain of smartphone as our case study. The experiments on 100,000 collected posts related to smartphones showed that the system could help indicating the customers' sentiments towards the product features, such as Application, Screen, and Camera. Further evaluation by experts in smartphone industry confirmed that the system yielded some valid results.","sourceIds":["journals/jucs/ChamlertwatBRH12"]},{"url":"https://www.semanticscholar.org/paper/Loose-tweets:-an-analysis-of-privacy-leaks-on-Mao-Shuai/264b337811e4add2b8f6c77fe5c09312ef8a9776?utm_campaign=DBLP+Prototype&utm_source=DBLP&utm_medium=Partner+API","title":"Loose tweets: an analysis of privacy leaks on twitter","authors":[{"name":"Huina Mao","url":"https://www.semanticscholar.org/author/Huina-Mao/12145107"},{"name":"Xin Shuai","url":"https://www.semanticscholar.org/author/Xin-Shuai/143712998"},{"name":"Apu Kapadia","url":"https://www.semanticscholar.org/author/Apu-Kapadia/145728136"}],"venue":"WPES '11","year":2011,"stats":{"influentialCitations":12,"estimatedTotalCitations":92.74468641358241,"velocity":13.666666666666666,"acceleration":-0.3333333333333333},"journal":{"pages":"1-12"},"paperAbstract":"Twitter has become one of the most popular microblogging sites for people to broadcast (or \"tweet\") their thoughts to the world in 140 characters or less. Since these messages are available for public consumption, one may expect these tweets not to contain private or incriminating information. Nevertheless we observe a large number of users who unwittingly post sensitive information about themselves and other people for whom there may be negative consequences. While some awareness exists of such privacy issues on social networks such as Twitter and Facebook, there has been no quantitative, scientific study addressing this problem.\n In this paper we make three major contributions. First, we characterize the nature of privacy leaks on Twitter to gain an understanding of what types of private information people are revealing on it. We specifically analyze three types of leaks: divulging vacation plans, tweeting under the influence of alcohol, and revealing medical conditions. Second, using this characterization we build automatic classifiers to detect incriminating tweets for these three topics in real time in order to demonstrate the real threat posed to users by, e.g., burglars and law enforcement. Third, we characterize who leaks information and how. We study both self- incriminating primary leaks and secondary leaks that reveal sensitive information about others, as well as the prevalence of leaks in status updates and conversation tweets. We also conduct a cross-cultural study to investigate the prevalence of leaks in tweets originating from the United States, United Kingdom and Singapore. Finally, we discuss how our classification system can be used as a defense mechanism to alert users of potential privacy leaks.","sourceIds":["conf/wpes/MaoSK11"]},{"url":"https://www.semanticscholar.org/paper/Differences-in-the-mechanics-of-information-across-Romero-Meeder/8b3c52d3f2770ab757c6bfe384b2536ab9f4dc30?utm_campaign=DBLP+Prototype&utm_source=DBLP&utm_medium=Partner+API","title":"Differences in the mechanics of information diffusion across topics: idioms, political hashtags, and complex contagion on twitter","authors":[{"name":"Daniel M. Romero","url":"https://www.semanticscholar.org/author/Daniel-M.-Romero/144463004"},{"name":"Brendan Meeder","url":"https://www.semanticscholar.org/author/Brendan-Meeder/1794786"},{"name":"Jon M. Kleinberg","url":"https://www.semanticscholar.org/author/Jon-M.-Kleinberg/3371403"}],"venue":"WWW","year":2011,"stats":{"influentialCitations":67,"estimatedTotalCitations":602.5763134202147,"velocity":68.66666666666667,"acceleration":-0.016666666666666666},"journal":{"pages":"695-704"},"paperAbstract":"There is a widespread intuitive sense that different kinds of information spread differently on-line, but it has been difficult to evaluate this question quantitatively since it requires a setting where many different kinds of information spread in a shared environment. Here we study this issue on Twitter, analyzing the ways in which tokens known as hashtags spread on a network defined by the interactions among Twitter users. We find significant variation in the ways that widely-used hashtags on different topics spread.\n Our results show that this variation is not attributable simply to differences in \"stickiness,\" the probability of adoption based on one or more exposures, but also to a quantity that could be viewed as a kind of \"persistence\" - the relative extent to which repeated exposures to a hashtag continue to have significant marginal effects. We find that hashtags on politically controversial topics are particularly persistent, with repeated exposures continuing to have unusually large marginal effects on adoption; this provides, to our knowledge, the first large-scale validation of the \"complex contagion\" principle from sociology, which posits that repeated exposures to an idea are particularly crucial when the idea is in some way controversial or contentious. Among other findings, we discover that hashtags representing the natural analogues of Twitter idioms and neologisms are particularly non-persistent, with the effect of multiple exposures decaying rapidly relative to the first exposure.\n We also study the subgraph structure of the initial adopters for different widely-adopted hashtags, again finding structural differences across topics. We develop simulation-based and generative models to analyze how the adoption dynamics interact with the network structure of the early adopters on which a hashtag spreads.","sourceIds":["conf/www/RomeroMK11"]},{"url":"https://www.semanticscholar.org/paper/Mapping-the-global-Twitter-heartbeat:-The-geography-Leetaru-Wang/f72df4871add85ad35a5ed24c37e4e1c824519a8?utm_campaign=DBLP+Prototype&utm_source=DBLP&utm_medium=Partner+API","title":"Mapping the global Twitter heartbeat: The geography of Twitter","authors":[{"name":"Kalev Leetaru","url":"https://www.semanticscholar.org/author/Kalev-Leetaru/2375671"},{"name":"Shaowen Wang","url":"https://www.semanticscholar.org/author/Shaowen-Wang/1791947"},{"name":"Guofeng Cao","url":"https://www.semanticscholar.org/author/Guofeng-Cao/2388635"},{"name":"Anand Padmanabhan","url":"https://www.semanticscholar.org/author/Anand-Padmanabhan/144300025"},{"name":"Eric Shook","url":"https://www.semanticscholar.org/author/Eric-Shook/2922516"}],"venue":"First Monday","year":2013,"stats":{"influentialCitations":22,"estimatedTotalCitations":149.9971566398789,"velocity":28.0,"acceleration":-0.5},"journal":{"name":"First Monday","volume":"18"},"paperAbstract":"In just under seven years, Twitter has grown to count nearly 3% of the entire global population among its active users who have sent more than 170 billion 140-character messages. Today the service plays such a significant role in American culture that the Library of Congress has assembled a permanent archive of the site back to its first tweet, updated daily. With its open API, Twitter has become one of the most popular data sources for social research, yet the majority of the literature has focused on it as a text or network graph source, with only limited efforts to date focusing exclusively on the geography of Twitter, assessing the various sources of geographic information on the service and their accuracy. More than 3% of all tweets are found to have native location information available, while a naive geocoder based on a simple major cities gazetteer and relying on the user-provided Location and Profile fields is able to geolocate more than a third of all tweets with high accuracy when measured against the GPS-based baseline. Geographic proximity is found to play a minimal role both in who users communicate with and what they communicate about, providing evidence that social media is shifting the communicative landscape.","sourceIds":["journals/firstmonday/LeetaruWCPS13"]},{"url":"https://www.semanticscholar.org/paper/On-Stopwords,-Filtering-and-Data-Sparsity-for-of-Saif-Fern%C3%A1ndez/0f9783b38358ab6aa3aa5aa85c75bc03c08572cf?utm_campaign=DBLP+Prototype&utm_source=DBLP&utm_medium=Partner+API","title":"On Stopwords, Filtering and Data Sparsity for Sentiment Analysis of Twitter","authors":[{"name":"Hassan Saif","url":"https://www.semanticscholar.org/author/Hassan-Saif/2874824"},{"name":"Miriam Fernández","url":"https://www.semanticscholar.org/author/Miriam-Fernández/152179862"},{"name":"Yulan He","url":"https://www.semanticscholar.org/author/Yulan-He/1704133"},{"name":"Harith Alani","url":"https://www.semanticscholar.org/author/Harith-Alani/145842687"}],"venue":"LREC","year":2014,"stats":{"influentialCitations":3,"estimatedTotalCitations":54.660910230111064,"velocity":20.0,"acceleration":-0.3076923076923077},"journal":{"pages":"810-817"},"paperAbstract":"Sentiment classification over Twitter is usually affected by the noisy nature (abbreviations, irregular forms) of tweets data. A popular procedure to reduce the noise of textual data is to remove stopwords by using pre-compiled stopword lists or more sophisticated methods for dynamic stopword identification. However, the effectiveness of removing stopwords in the context of Twitter sentiment classification has been debated in the last few years. In this paper we investigate whether removing stopwords helps or hampers the effectiveness of Twitter sentiment classification methods. To this end, we apply six different stopword identification methods to Twitter data from six different datasets and observe how removing stopwords affects two well-known supervised sentiment classification methods. We assess the impact of removing stopwords by observing fluctuations on the level of data sparsity, the size of the classifier's feature space and its classification performance. Our results show that using pre-compiled lists of stopwords negatively impacts the performance of Twitter sentiment classification approaches. On the other hand, the dynamic generation of stopword lists, by removing those infrequent terms appearing only once in the corpus, appears to be the optimal method to maintaining a high classification performance while reducing the data sparsity and substantially shrinking the feature space","sourceIds":["conf/lrec/SaifFHA14"]},{"url":"https://www.semanticscholar.org/paper/Dengue-surveillance-based-on-a-computational-model-Gomide-Veloso/79aa850c3e9a13a1a00d6e42acd68d17c5eabd0c?utm_campaign=DBLP+Prototype&utm_source=DBLP&utm_medium=Partner+API","title":"Dengue surveillance based on a computational model of spatio-temporal locality of Twitter","authors":[{"name":"Janaína Gomide","url":"https://www.semanticscholar.org/author/Janaína-Gomide/2460985"},{"name":"Adriano Veloso","url":"https://www.semanticscholar.org/author/Adriano-Veloso/1685147"},{"name":"Wagner Meira","url":"https://www.semanticscholar.org/author/Wagner-Meira/1691267"},{"name":"Virgílio A. F. Almeida","url":"https://www.semanticscholar.org/author/Virgílio-A.-F.-Almeida/145624017"},{"name":"Fabrício Benevenuto","url":"https://www.semanticscholar.org/author/Fabrício-Benevenuto/1869561"},{"name":"Fernanda Ferraz","url":"https://www.semanticscholar.org/author/Fernanda-Ferraz/145898969"},{"name":"Mauro Teixeira","url":"https://www.semanticscholar.org/author/Mauro-Teixeira/120869548"}],"venue":"WebSci '11","year":2011,"stats":{"influentialCitations":12,"estimatedTotalCitations":117.55066298452702,"velocity":18.333333333333332,"acceleration":-0.125},"journal":{"pages":"3:1-3:8"},"paperAbstract":"Twitter is a unique social media channel, in the sense that users discuss and talk about the most diverse topics, including their health conditions. In this paper we analyze how Dengue epidemic is reflected on Twitter and to what extent that information can be used for the sake of surveillance. Dengue is a mosquito-borne infectious disease that is a leading cause of illness and death in tropical and subtropical regions, including Brazil. We propose an active surveillance methodology that is based on four dimensions: volume, location, time and public perception. First we explore the public perception dimension by performing sentiment analysis. This analysis enables us to filter out content that is not relevant for the sake of Dengue surveillance. Then, we verify the high correlation between the number of cases reported by official statistics and the number of tweets posted during the same time period (i.e., R2 = 0.9578). A clustering approach was used in order to exploit the spatio-temporal dimension, and the quality of the clusters obtained becomes evident when they are compared to official data (i.e., RandIndex = 0.8914). As an application, we propose a Dengue surveillance system that shows the evolution of the dengue situation reported in tweets, which is implemented in www.observatorio.inweb.org.br/dengue/.","sourceIds":["conf/websci/GomideVMABFT11"]},{"url":"https://www.semanticscholar.org/paper/Identifying-communicator-roles-in-twitter-Tinati-Carr/324eac3e62cc4bf1f3935ab792b17f1e5239e6b2?utm_campaign=DBLP+Prototype&utm_source=DBLP&utm_medium=Partner+API","title":"Identifying communicator roles in twitter","authors":[{"name":"Ramine Tinati","url":"https://www.semanticscholar.org/author/Ramine-Tinati/2050678"},{"name":"Les Carr","url":"https://www.semanticscholar.org/author/Les-Carr/1727183"},{"name":"Wendy Hall","url":"https://www.semanticscholar.org/author/Wendy-Hall/143786158"},{"name":"Jonny Bentwood","url":"https://www.semanticscholar.org/author/Jonny-Bentwood/2992759"}],"venue":"WWW","year":2012,"stats":{"influentialCitations":2,"estimatedTotalCitations":64.76196836189196,"velocity":8.0},"journal":{"pages":"1161-1168"},"paperAbstract":"Twitter has redefined the way social activities can be coordinated; used for mobilizing people during natural disasters, studying health epidemics, and recently, as a communication platform during social and political change. As a large scale system, the volume of data transmitted per day presents Twitter users with a problem: how can valuable content be distilled from the back chatter, how can the providers of valuable information be promoted, and ultimately how can influential individuals be identified? To tackle this, we have developed a model based upon the Twitter message exchange which enables us to analyze conversations around specific topics and identify key players in a conversation. A working implementation of the model helps categorize Twitter users by specific roles based on their dynamic communication behavior rather than an analysis of their static friendship network. This provides a method of identifying users who are potentially producers or distributers of valuable knowledge.","sourceIds":["conf/www/TinatiCHB12"]},{"url":"https://www.semanticscholar.org/paper/Limits-of-Electoral-Predictions-Using-Twitter-Gayo-Avello-Metaxas/c67ff3ea09004fca8690a514b6f9f35a063aee00?utm_campaign=DBLP+Prototype&utm_source=DBLP&utm_medium=Partner+API","title":"Limits of Electoral Predictions Using Twitter","authors":[{"name":"Daniel Gayo-Avello","url":"https://www.semanticscholar.org/author/Daniel-Gayo-Avello/3225415"},{"name":"Panagiotis Takis Metaxas","url":"https://www.semanticscholar.org/author/Panagiotis-Takis-Metaxas/2806143"},{"name":"Eni Mustafaraj","url":"https://www.semanticscholar.org/author/Eni-Mustafaraj/2261457"}],"venue":"ICWSM","year":2011,"stats":{"influentialCitations":13,"estimatedTotalCitations":118.47901072638913,"velocity":22.0,"acceleration":-0.375},"paperAbstract":"Using social media for political discourse is becoming common practice, especially around election time. One interesting aspect of this trend is the possibility of pulsing the public’s opinion about the elections, and that has attracted the interest of many researchers and the press. Allegedly, predicting electoral outcomes from social media data can be feasible and even simple. Positive results have been reported, but without an analysis on what principle enables them. Our work puts to test the purported predictive power of socialmedia metrics against the 2010 US congressional elections. Here, we applied techniques that had reportedly led to positive election predictions in the past, on the Twitter data collected from the 2010 US congressional elections. Unfortunately, we find no correlation between the analysis results and the electoral outcomes, contradicting previous reports. Observing that 80 years of polling research would support our findings, we argue that one should not be accepting predictions about events using social media data as a black box. Instead, scholarly research should be accompanied by a model explaining the predictive power of social media, when there is one.","sourceIds":["conf/icwsm/Gayo-AvelloMM11"]},{"url":"https://www.semanticscholar.org/paper/Google-news-personalization:-scalable-online-Das-Datar/7e104b1968b9ec09af0f6b480a46fc1ce884c3bc?utm_campaign=DBLP+Prototype&utm_source=DBLP&utm_medium=Partner+API","title":"Google news personalization: scalable online collaborative filtering","authors":[{"name":"Abhinandan Das","url":"https://www.semanticscholar.org/author/Abhinandan-Das/2892654"},{"name":"Mayur Datar","url":"https://www.semanticscholar.org/author/Mayur-Datar/145112445"},{"name":"Ashutosh Garg","url":"https://www.semanticscholar.org/author/Ashutosh-Garg/1729828"},{"name":"Shyam Kumar Rajaram","url":"https://www.semanticscholar.org/author/Shyam-Kumar-Rajaram/32262375"}],"venue":"WWW '07","year":2007,"stats":{"influentialCitations":91,"estimatedTotalCitations":913.6095855526034,"velocity":89.0,"acceleration":0.10256410256410256},"journal":{"pages":"271-280"},"paperAbstract":"Several approaches to collaborative filtering have been studied but seldom have studies been reported for large (several millionusers and items) and dynamic (the underlying item set is continually changing) settings. In this paper we describe our approach to collaborative filtering for generating personalized recommendations for users of Google News. We generate recommendations using three approaches: collaborative filtering using MinHash clustering, Probabilistic Latent Semantic Indexing (PLSI), and covisitation counts. We combine recommendations from different algorithms using a linear model. Our approach is content agnostic and consequently domain independent, making it easily adaptable for other applications and languages with minimal effort. This paper will describe our algorithms and system setup in detail, and report results of running the recommendations engine on Google News.","sourceIds":["conf/www/DasDGR07"]},{"url":"https://www.semanticscholar.org/paper/Outtweeting-the-Twitterers-Predicting-Information-Galuba-Aberer/1592c9ad9cafdb44be195bbca10508eb3d5a523a?utm_campaign=DBLP+Prototype&utm_source=DBLP&utm_medium=Partner+API","title":"Outtweeting the Twitterers - Predicting Information Cascades in Microblogs","authors":[{"name":"Wojciech Galuba","url":"https://www.semanticscholar.org/author/Wojciech-Galuba/1740364"},{"name":"Karl Aberer","url":"https://www.semanticscholar.org/author/Karl-Aberer/1751802"},{"name":"Dipanjan Chakraborty","url":"https://www.semanticscholar.org/author/Dipanjan-Chakraborty/47021594"},{"name":"Zoran Despotovic","url":"https://www.semanticscholar.org/author/Zoran-Despotovic/1779291"},{"name":"Wolfgang Kellerer","url":"https://www.semanticscholar.org/author/Wolfgang-Kellerer/9358170"}],"venue":"WOSN","year":2010,"stats":{"influentialCitations":25,"estimatedTotalCitations":173.8061392963572,"velocity":14.666666666666666,"acceleration":0.07692307692307693},"paperAbstract":"Microblogging sites are a unique and dynamic Web 2.0 communication medium. Understanding the information flow in these systems can not only provide better insights into the underlying sociology, but is also crucial for applications such as content ranking, recommendation and filtering, spam detection and viral marketing. In this paper, we characterize the propagation of URLs in the social network of Twitter, a popular microblogging site. We track 15 million URLs exchanged among 2.7 million users over a 300 hour period. Data analysis uncovers several statistical regularities in the user activity, the social graph, the structure of the URL cascades and the communication dynamics. Based on these results we propose a propagation model that predicts which users are likely to mention which URLs. The model correctly accounts for more than half of the URL mentions in our data set, while maintaining a false positive rate lower than 15%.","sourceIds":["conf/wosn/GalubaA0DK10"]},{"url":"https://www.semanticscholar.org/paper/TwiNER:-named-entity-recognition-in-targeted-stream-Li-Weng/5feb6d5f47295009ac8286a1cb2aa065aaf3ea9a?utm_campaign=DBLP+Prototype&utm_source=DBLP&utm_medium=Partner+API","title":"TwiNER: named entity recognition in targeted twitter stream","authors":[{"name":"Chenliang Li","url":"https://www.semanticscholar.org/author/Chenliang-Li/2829009"},{"name":"Jianshu Weng","url":"https://www.semanticscholar.org/author/Jianshu-Weng/1974162"},{"name":"Qi He","url":"https://www.semanticscholar.org/author/Qi-He/145109822"},{"name":"Yuxia Yao","url":"https://www.semanticscholar.org/author/Yuxia-Yao/2979889"},{"name":"Anwitaman Datta","url":"https://www.semanticscholar.org/author/Anwitaman-Datta/145688317"},{"name":"Aixin Sun","url":"https://www.semanticscholar.org/author/Aixin-Sun/1735962"},{"name":"Bu-Sung Lee","url":"https://www.semanticscholar.org/author/Bu-Sung-Lee/1717989"}],"venue":"SIGIR '12","year":2012,"stats":{"influentialCitations":28,"estimatedTotalCitations":155.9377827966766,"velocity":17.0,"acceleration":-0.25},"journal":{"pages":"721-730"},"paperAbstract":"Many private and/or public organizations have been reported to create and monitor targeted Twitter streams to collect and understand users' opinions about the organizations. Targeted Twitter stream is usually constructed by filtering tweets with user-defined selection criteria e.g. tweets published by users from a selected region, or tweets that match one or more predefined keywords. Targeted Twitter stream is then monitored to collect and understand users' opinions about the organizations. There is an emerging need for early crisis detection and response with such target stream. Such applications require a good named entity recognition (NER) system for Twitter, which is able to automatically discover emerging named entities that is potentially linked to the crisis. In this paper, we present a novel 2-step unsupervised NER system for targeted Twitter stream, called TwiNER. In the first step, it leverages on the global context obtained from Wikipedia and Web N-Gram corpus to partition tweets into valid segments (phrases) using a dynamic programming algorithm. Each such tweet segment is a candidate named entity. It is observed that the named entities in the targeted stream usually exhibit a gregarious property, due to the way the targeted stream is constructed. In the second step, TwiNER constructs a random walk model to exploit the gregarious property in the local context derived from the Twitter stream. The highly-ranked segments have a higher chance of being true named entities. We evaluated TwiNER on two sets of real-life tweets simulating two targeted streams. Evaluated using labeled ground truth, TwiNER achieves comparable performance as with conventional approaches in both streams. Various settings of TwiNER have also been examined to verify our global context + local context combo idea.","sourceIds":["conf/sigir/LiWHYDSL12"]},{"url":"https://www.semanticscholar.org/paper/From-ADHD-to-SAD:-Analyzing-the-Language-of-Mental-Coppersmith-Dredze/49d271c1cb6b0f11c1495567e8c13dacd854f589?utm_campaign=DBLP+Prototype&utm_source=DBLP&utm_medium=Partner+API","title":"From ADHD to SAD: Analyzing the Language of Mental Health on Twitter through Self-Reported Diagnoses","authors":[{"name":"Glen Coppersmith","url":"https://www.semanticscholar.org/author/Glen-Coppersmith/4366352"},{"name":"Mark Dredze","url":"https://www.semanticscholar.org/author/Mark-Dredze/1782853"},{"name":"Craig Harman","url":"https://www.semanticscholar.org/author/Craig-Harman/145411141"},{"name":"Kristy Hollingshead","url":"https://www.semanticscholar.org/author/Kristy-Hollingshead/2807223"}],"venue":"CLPsych@HLT-NAACL","year":2015,"stats":{"influentialCitations":18,"estimatedTotalCitations":109.29583961790749,"velocity":29.0,"acceleration":0.17391304347826086},"journal":{"pages":"1-10"},"paperAbstract":"Many significant challenges exist for the mental health field, but one in particular is a lack of data available to guide research. Language provides a natural lens for studying mental health ‐ much existing work and therapy have strong linguistic components, so the creation of a large, varied, language-centric dataset could provide significant grist for the field of mental health research. We examine a broad range of mental health conditions in Twitter data by identifying self-reported statements of diagnosis. We systematically explore language differences between ten conditions with respect to the general population, and to each other. Our aim is to provide guidance and a roadmap for where deeper exploration is likely to be fruitful.","sourceIds":["conf/naacl/CoppersmithDHH15"]},{"url":"https://www.semanticscholar.org/paper/Sensing-Trending-Topics-in-Twitter-Aiello-Petkos/f82dd04de0f4cbd4ba31f201655a788c6576343f?utm_campaign=DBLP+Prototype&utm_source=DBLP&utm_medium=Partner+API","title":"Sensing Trending Topics in Twitter","authors":[{"name":"Luca Maria Aiello","url":"https://www.semanticscholar.org/author/Luca-Maria-Aiello/2905635"},{"name":"Georgios Petkos","url":"https://www.semanticscholar.org/author/Georgios-Petkos/70629521"},{"name":"Carlos J. Martín-Dancausa","url":"https://www.semanticscholar.org/author/Carlos-J.-Martín-Dancausa/1401730751"},{"name":"David Corney","url":"https://www.semanticscholar.org/author/David-Corney/1801487"},{"name":"Symeon Papadopoulos","url":"https://www.semanticscholar.org/author/Symeon-Papadopoulos/48594399"},{"name":"Ryan Skraba","url":"https://www.semanticscholar.org/author/Ryan-Skraba/2157341"},{"name":"Ayse Göker","url":"https://www.semanticscholar.org/author/Ayse-Göker/1731666"},{"name":"Yiannis Kompatsiaris","url":"https://www.semanticscholar.org/author/Yiannis-Kompatsiaris/1715604"},{"name":"Alejandro Jaimes","url":"https://www.semanticscholar.org/author/Alejandro-Jaimes/144633617"}],"venue":"IEEE Transactions on Multimedia","year":2013,"stats":{"influentialCitations":35,"estimatedTotalCitations":178.17681534583872,"velocity":32.0,"acceleration":-0.06896551724137931},"journal":{"name":"IEEE Transactions on Multimedia","volume":"15","pages":"1268-1282"},"paperAbstract":"Online social and news media generate rich and timely information about real-world events of all kinds. However, the huge amount of data available, along with the breadth of the user base, requires a substantial effort of information filtering to successfully drill down to relevant topics and events. Trending topic detection is therefore a fundamental building block to monitor and summarize information originating from social sources. There are a wide variety of methods and variables and they greatly affect the quality of results. We compare six topic detection methods on three Twitter datasets related to major events, which differ in their time scale and topic churn rate. We observe how the nature of the event considered, the volume of activity over time, the sampling procedure and the pre-processing of the data all greatly affect the quality of detected topics, which also depends on the type of detection method used. We find that standard natural language processing techniques can perform well for social streams on very focused topics, but novel techniques designed to mine the temporal distribution of concepts are needed to handle more heterogeneous streams containing multiple stories evolving in parallel. One of the novel topic detection methods we propose, based on -grams cooccurrence and topic ranking, consistently achieves the best performance across all these conditions, thus being more reliable than other state-of-the-art techniques.","sourceIds":["journals/tmm/AielloPMCPSGKJ13"]},{"url":"https://www.semanticscholar.org/paper/Early-Warning-and-Outbreak-Detection-Using-Social-Quincey-Kostkova/c1605dc51ce6eda9de7871fd4b066c2ae2e9184d?utm_campaign=DBLP+Prototype&utm_source=DBLP&utm_medium=Partner+API","title":"Early Warning and Outbreak Detection Using Social Networking Websites: The Potential of Twitter","authors":[{"name":"Ed de Quincey","url":"https://www.semanticscholar.org/author/Ed-de-Quincey/10194231"},{"name":"Patty Kostkova","url":"https://www.semanticscholar.org/author/Patty-Kostkova/145770833"}],"venue":"eHealth","year":2009,"stats":{"influentialCitations":4,"estimatedTotalCitations":54.73640738890302,"velocity":5.333333333333333},"journal":{"pages":"21-24"},"paperAbstract":"Epidemic Intelligence is being used to gather information about potential diseases outbreaks from both formal and increasingly informal sources. A potential addition to these informal sources are social networking sites such as Facebook and Twitter. In this paper we describe a method for extracting messages, called “tweets” from the Twitter website and the results of a pilot study which collected over 135,000 tweets in a week during the current Swine Flu pandemic.","sourceIds":["conf/ehealth/QuinceyK09"]},{"url":"https://www.semanticscholar.org/paper/Understanding-Human-Mobility-from-Twitter-Jurdak-Zhao/c7b60647bb57bade97817c4296d51e9da81feeb7?utm_campaign=DBLP+Prototype&utm_source=DBLP&utm_medium=Partner+API","title":"Understanding Human Mobility from Twitter","authors":[{"name":"Raja Jurdak","url":"https://www.semanticscholar.org/author/Raja-Jurdak/1770270"},{"name":"Kun Zhao","url":"https://www.semanticscholar.org/author/Kun-Zhao/144314685"},{"name":"Jiajun Liu","url":"https://www.semanticscholar.org/author/Jiajun-Liu/49721729"},{"name":"Maurice AbouJaoude","url":"https://www.semanticscholar.org/author/Maurice-AbouJaoude/48595274"},{"name":"Mark A. Cameron","url":"https://www.semanticscholar.org/author/Mark-A.-Cameron/2323247"},{"name":"David Newth","url":"https://www.semanticscholar.org/author/David-Newth/145874672"}],"venue":"PloS one","year":2015,"stats":{"influentialCitations":8,"estimatedTotalCitations":83.94957674711874,"velocity":26.666666666666668,"acceleration":-0.28},"journal":{"name":"","volume":"10","pages":"e37027 - 21489"},"paperAbstract":"Understanding human mobility is crucial for a broad range of applications from disease prediction to communication networks. Most efforts on studying human mobility have so far used private and low resolution data, such as call data records. Here, we propose Twitter as a proxy for human mobility, as it relies on publicly available data and provides high resolution positioning when users opt to geotag their tweets with their current location. We analyse a Twitter dataset with more than six million geotagged tweets posted in Australia, and we demonstrate that Twitter can be a reliable source for studying human mobility patterns. Our analysis shows that geotagged tweets can capture rich features of human mobility, such as the diversity of movement orbits among individuals and of movements within and between cities. We also find that short- and long-distance movers both spend most of their time in large metropolitan areas, in contrast with intermediate-distance movers' movements, reflecting the impact of different modes of travel. Our study provides solid evidence that Twitter can indeed be a useful proxy for tracking and predicting human movement.","sourceIds":["journals/corr/JurdakZLACN14"]},{"url":"https://www.semanticscholar.org/paper/Summarizing-sporting-events-using-twitter-Nichols-Mahmud/d8d39b821c9bda9d05592a36bb363776134db510?utm_campaign=DBLP+Prototype&utm_source=DBLP&utm_medium=Partner+API","title":"Summarizing sporting events using twitter","authors":[{"name":"Jeffrey Nichols","url":"https://www.semanticscholar.org/author/Jeffrey-Nichols/145744729"},{"name":"Jalal Mahmud","url":"https://www.semanticscholar.org/author/Jalal-Mahmud/145359935"},{"name":"Clemens Drews","url":"https://www.semanticscholar.org/author/Clemens-Drews/2763565"}],"venue":"IUI '12","year":2012,"stats":{"influentialCitations":15,"estimatedTotalCitations":154.33815848210392,"velocity":23.666666666666668,"acceleration":-0.2},"journal":{"pages":"189-198"},"paperAbstract":"The status updates posted to social networks, such as Twitter and Facebook, contain a myriad of information about what people are doing and watching. During events, such as sports games, many updates are sent describing and expressing opinions about the event. In this paper, we describe an algorithm that generates a journalistic summary of an event using only status updates from Twitter as a source. Temporal cues, such as spikes in the volume of status updates, are used to identify the important moments within an event, and a sentence ranking method is used to extract relevant sentences from the corpus of status updates describing each important moment within an event. We evaluate our algorithm compared to human-generated summaries and the previous best summarization algorithm, and find that the results of our method are superior to the previous algorithm and approach the readability and grammaticality of the human-generated summaries.","sourceIds":["conf/iui/NicholsMD12"]},{"url":"https://www.semanticscholar.org/paper/Using-Matched-Samples-to-Estimate-the-Effects-of-on-Reis-Culotta/c9ec8556d256d4c98ee36e4f71a6f041c3ba79a7?utm_campaign=DBLP+Prototype&utm_source=DBLP&utm_medium=Partner+API","title":"Using Matched Samples to Estimate the Effects of Exercise on Mental Health via Twitter","authors":[{"name":"Virgile Landeiro Dos Reis","url":"https://www.semanticscholar.org/author/Virgile-Landeiro-Dos-Reis/35160951"},{"name":"Aron Culotta","url":"https://www.semanticscholar.org/author/Aron-Culotta/1741453"}],"venue":"AAAI","year":2015,"stats":{"influentialCitations":1,"velocity":8.666666666666666},"journal":{"pages":"182-188"},"paperAbstract":"Recent work has demonstrated the value of social media monitoring for health surveillance (e.g., tracking influenza or depression rates). It is an open question whether such data can be used to make causal inferences (e.g., determining which activities lead to increased depression rates). Even in traditional, restricted domains, estimating causal effects from observational data is highly susceptible to confounding bias. In this work, we estimate the effect of exercise on mental health from Twitter, relying on statistical matching methods to reduce confounding bias. We train a text classifier to estimate the volume of a user's tweets expressing anxiety, depression, or anger, then compare two groups: those who exercise regularly (identified by their use of physical activity trackers like Nike+), and a matched control group. We find that those who exercise regularly have significantly fewer tweets expressing depression or anxiety; there is no significant difference in rates of tweets expressing anger. We additionally perform a sensitivity analysis to investigate how the many experimental design choices in such a study impact the final conclusions, including the quality of the classifier and the construction of the control group.","sourceIds":["conf/aaai/ReisC15"]},{"url":"https://www.semanticscholar.org/paper/Temporal-Patterns-of-Happiness-and-Information-in-a-Dodds-Harris/09f692cf26f283a22484443cc07aa7cc1f8e70f0?utm_campaign=DBLP+Prototype&utm_source=DBLP&utm_medium=Partner+API","title":"Temporal Patterns of Happiness and Information in a Global Social Network: Hedonometrics and Twitter","authors":[{"name":"Peter Sheridan Dodds","url":"https://www.semanticscholar.org/author/Peter-Sheridan-Dodds/2660575"},{"name":"Kameron Decker Harris","url":"https://www.semanticscholar.org/author/Kameron-Decker-Harris/7917904"},{"name":"Isabel M. Kloumann","url":"https://www.semanticscholar.org/author/Isabel-M.-Kloumann/2207049"},{"name":"Catherine A. Bliss","url":"https://www.semanticscholar.org/author/Catherine-A.-Bliss/2638357"},{"name":"Christopher M. Danforth","url":"https://www.semanticscholar.org/author/Christopher-M.-Danforth/2310860"}],"venue":"PloS one","year":2011,"stats":{"influentialCitations":53,"estimatedTotalCitations":338.2465428882959,"velocity":48.0,"acceleration":-0.1111111111111111},"journal":{"name":"PLoS ONE","volume":"6","pages":"786 - 786"},"paperAbstract":"Individual happiness is a fundamental societal metric. Normally measured through self-report, happiness has often been indirectly characterized and overshadowed by more readily quantifiable economic indicators such as gross domestic product. Here, we examine expressions made on the online, global microblog and social networking service Twitter, uncovering and explaining temporal variations in happiness and information levels over timescales ranging from hours to years. Our data set comprises over 46 billion words contained in nearly 4.6 billion expressions posted over a 33 month span by over 63 million unique users. In measuring happiness, we construct a tunable, real-time, remote-sensing, and non-invasive, text-based hedonometer. In building our metric, made available with this paper, we conducted a survey to obtain happiness evaluations of over 10,000 individual words, representing a tenfold size improvement over similar existing word sets. Rather than being ad hoc, our word list is chosen solely by frequency of usage, and we show how a highly robust and tunable metric can be constructed and defended.","sourceIds":["journals/corr/abs-1101-5120"]},{"url":"https://www.semanticscholar.org/paper/Amazon.com-Recommendations:-Item-to-Item-Filtering-Linden-Smith/da8b0378174bc25ed174be36a1c725787b81854d?utm_campaign=DBLP+Prototype&utm_source=DBLP&utm_medium=Partner+API","title":"Amazon.com Recommendations: Item-to-Item Collaborative Filtering","authors":[{"name":"Greg Linden","url":"https://www.semanticscholar.org/author/Greg-Linden/30182834"},{"name":"Brent Smith","url":"https://www.semanticscholar.org/author/Brent-Smith/26512579"},{"name":"Jeremy York","url":"https://www.semanticscholar.org/author/Jeremy-York/145614962"}],"venue":"IEEE Internet Comput.","year":2003,"stats":{"influentialCitations":245,"estimatedTotalCitations":2605.562655873114,"velocity":308.6666666666667,"acceleration":-0.17933130699088146},"journal":{"name":"IEEE Internet Comput.","volume":"7","pages":"76-80"},"paperAbstract":"Recommendation algorithms are best known for their use on e-commerce Web sites, where they use input about a customer's interests to generate a list of recommended items. Many applications use only the items that customers purchase and explicitly rate to represent their interests, but they can also use other attributes, including items viewed, demographic data, subject interests, and favorite artists. At Amazon.com, we use recommendation algorithms to personalize the online store for each customer. The store radically changes based on customer interests, showing programming titles to a software engineer and baby toys to a new mother. There are three common approaches to solving the recommendation problem: traditional collaborative filtering, cluster models, and search-based methods. Here, we compare these methods with our algorithm, which we call item-to-item collaborative filtering. Unlike traditional collaborative filtering, our algorithm's online computation scales independently of the number of customers and number of items in the product catalog. Our algorithm produces recommendations in real-time, scales to massive data sets, and generates high quality recommendations.","sourceIds":["journals/internet/LindenSY03","journals/dsonline/LindenSY03"]},{"url":"https://www.semanticscholar.org/paper/The-DARPA-Twitter-Bot-Challenge-Subrahmanian-Azaria/1f779bb04bf3510cc8b0fc8f5dba896f5e4e6b95?utm_campaign=DBLP+Prototype&utm_source=DBLP&utm_medium=Partner+API","title":"The DARPA Twitter Bot Challenge","authors":[{"name":"V. S. Subrahmanian","url":"https://www.semanticscholar.org/author/V.-S.-Subrahmanian/1728462"},{"name":"Amos Azaria","url":"https://www.semanticscholar.org/author/Amos-Azaria/1746466"},{"name":"Skylar Durst","url":"https://www.semanticscholar.org/author/Skylar-Durst/1409294970"},{"name":"Vadim Kagan","url":"https://www.semanticscholar.org/author/Vadim-Kagan/39129866"},{"name":"Aram Galstyan","url":"https://www.semanticscholar.org/author/Aram-Galstyan/143728483"},{"name":"Kristina Lerman","url":"https://www.semanticscholar.org/author/Kristina-Lerman/1782658"},{"name":"Linhong Zhu","url":"https://www.semanticscholar.org/author/Linhong-Zhu/2663662"},{"name":"Emilio Ferrara","url":"https://www.semanticscholar.org/author/Emilio-Ferrara/48898287"},{"name":"Alessandro Flammini","url":"https://www.semanticscholar.org/author/Alessandro-Flammini/1769960"},{"name":"Filippo Menczer","url":"https://www.semanticscholar.org/author/Filippo-Menczer/143653471"},{"name":"Rand Waltzman","url":"https://www.semanticscholar.org/author/Rand-Waltzman/2455875"},{"name":"Andrew Stevens","url":"https://www.semanticscholar.org/author/Andrew-Stevens/32296043"},{"name":"Alex Dekhtyar","url":"https://www.semanticscholar.org/author/Alex-Dekhtyar/145712627"},{"name":"Shuyang Gao","url":"https://www.semanticscholar.org/author/Shuyang-Gao/150296031"},{"name":"Tad Hogg","url":"https://www.semanticscholar.org/author/Tad-Hogg/153737088"},{"name":"Farshad Kooti","url":"https://www.semanticscholar.org/author/Farshad-Kooti/1797355"},{"name":"Yan Liu","url":"https://www.semanticscholar.org/author/Yan-Liu/144102534"},{"name":"Onur Varol","url":"https://www.semanticscholar.org/author/Onur-Varol/2307347"},{"name":"Prashant Shiralkar","url":"https://www.semanticscholar.org/author/Prashant-Shiralkar/3310534"},{"name":"V.G.Vinod Vydiswaran","url":"https://www.semanticscholar.org/author/V.G.Vinod-Vydiswaran/145126492"},{"name":"Qiaozhu Mei","url":"https://www.semanticscholar.org/author/Qiaozhu-Mei/1743469"},{"name":"Tim Huang","url":"https://www.semanticscholar.org/author/Tim-Huang/3651495"}],"venue":"Computer","year":2016,"stats":{"influentialCitations":12,"estimatedTotalCitations":154.0441086386095,"velocity":43.0,"acceleration":-0.16981132075471697},"journal":{"name":"Computer","volume":"49","pages":"38-46"},"paperAbstract":"From politicians and nation states to terrorist groups, numerous organizations reportedly conduct explicit campaigns to influence opinions on social media, posing a risk to freedom of expression. Thus, there is a need to identify and eliminate \"influence bots\" - realistic, automated identities that illicitly shape discussions on sites like Twitter and Facebook - before they get too influential.","sourceIds":["journals/computer/SubrahmanianADK16","journals/corr/SubrahmanianADK16"]},{"url":"https://www.semanticscholar.org/paper/Contextual-semantics-for-sentiment-analysis-of-Saif-He/b060df8710ce6178e76524c9f0a03718fc7bf7d1?utm_campaign=DBLP+Prototype&utm_source=DBLP&utm_medium=Partner+API","title":"Contextual semantics for sentiment analysis of Twitter","authors":[{"name":"Hassan Saif","url":"https://www.semanticscholar.org/author/Hassan-Saif/2874824"},{"name":"Yulan He","url":"https://www.semanticscholar.org/author/Yulan-He/1704133"},{"name":"Miriam Fernández","url":"https://www.semanticscholar.org/author/Miriam-Fernández/152179862"},{"name":"Harith Alani","url":"https://www.semanticscholar.org/author/Harith-Alani/145842687"}],"venue":"Inf. Process. Manag.","year":2016,"stats":{"influentialCitations":9,"estimatedTotalCitations":104.42899446365044,"velocity":33.666666666666664,"acceleration":0.03125},"journal":{"name":"Inf. Process. Manag.","volume":"52","pages":"5-19"},"paperAbstract":"We propose a semantic sentiment representation of words called SentiCircle.SentiCircle captures the contextual semantic of words from their co-occurrences.SentiCircle updates the sentiment of words based on their contextual semantics.SentiCircle can be used to perform entity- and tweet-level level sentiment analysis. Sentiment analysis on Twitter has attracted much attention recently due to its wide applications in both, commercial and public sectors. In this paper we present SentiCircles, a lexicon-based approach for sentiment analysis on Twitter. Different from typical lexicon-based approaches, which offer a fixed and static prior sentiment polarities of words regardless of their context, SentiCircles takes into account the co-occurrence patterns of words in different contexts in tweets to capture their semantics and update their pre-assigned strength and polarity in sentiment lexicons accordingly. Our approach allows for the detection of sentiment at both entity-level and tweet-level. We evaluate our proposed approach on three Twitter datasets using three different sentiment lexicons to derive word prior sentiments. Results show that our approach significantly outperforms the baselines in accuracy and F-measure for entity-level subjectivity (neutral vs. polar) and polarity (positive vs. negative) detections. For tweet-level sentiment detection, our approach performs better than the state-of-the-art SentiStrength by 4-5% in accuracy in two datasets, but falls marginally behind by 1% in F-measure in the third dataset.","sourceIds":["journals/ipm/SaifHFA16"]},{"url":"https://www.semanticscholar.org/paper/Forecasting-with-twitter-data-Arias-Arratia/600b87c43bcb96ad9431be4ea1781b35413b5e0e?utm_campaign=DBLP+Prototype&utm_source=DBLP&utm_medium=Partner+API","title":"Forecasting with twitter data","authors":[{"name":"Marta Arias","url":"https://www.semanticscholar.org/author/Marta-Arias/144222033"},{"name":"Argimiro Arratia","url":"https://www.semanticscholar.org/author/Argimiro-Arratia/3096973"},{"name":"Ramon Xuriguera","url":"https://www.semanticscholar.org/author/Ramon-Xuriguera/3263857"}],"venue":"TIST","year":2013,"stats":{"influentialCitations":6,"estimatedTotalCitations":51.50354775614855,"velocity":14.666666666666666,"acceleration":-0.4375},"journal":{"name":"ACM TIST","volume":"5","pages":"8:1-8:24"},"paperAbstract":"The dramatic rise in the use of social network platforms such as Facebook or Twitter has resulted in the availability of vast and growing user-contributed repositories of data. Exploiting this data by extracting useful information from it has become a great challenge in data mining and knowledge discovery. A recently popular way of extracting useful information from social network platforms is to build indicators, often in the form of a time series, of general public mood by means of sentiment analysis. Such indicators have been shown to correlate with a diverse variety of phenomena.\n In this article we follow this line of work and set out to assess, in a rigorous manner, whether a public sentiment indicator extracted from daily Twitter messages can indeed improve the forecasting of social, economic, or commercial indicators. To this end we have collected and processed a large amount of Twitter posts from March 2011 to the present date for two very different domains: stock market and movie box office revenue. For each of these domains, we build and evaluate forecasting models for several target time series both using and ignoring the Twitter-related data. If Twitter does help, then this should be reflected in the fact that the predictions of models that use Twitter-related data are better than the models that do not use this data. By systematically varying the models that we use and their parameters, together with other tuning factors such as lag or the way in which we build our Twitter sentiment index, we obtain a large dataset that allows us to test our hypothesis under different experimental conditions. Using a novel decision-tree-based technique that we call summary tree we are able to mine this large dataset and obtain automatically those configurations that lead to an improvement in the prediction power of our forecasting models. As a general result, we have seen that nonlinear models do take advantage of Twitter data when forecasting trends in volatility indices, while linear ones fail systematically when forecasting any kind of financial time series. In the case of predicting box office revenue trend, it is support vector machines that make best use of Twitter data. In addition, we conduct statistical tests to determine the relation between our Twitter time series and the different target time series.","sourceIds":["journals/tist/AriasAX13"]}],"total":6993}